return {
	title={"keyId","question","answer","inputId"},
		records={
						{1,"您每日游玩本游戏的时间为多久？","[\"A 0~1小时\",\"B 1~2小时\",\"C 2~4小时\",\"D 4小时以上\"]",0},
						{2,"您对近期版本更新的满意度为多少？（满分5分）","[\"A 5分 \",\"B 4分 \",\"C 3分 \",\"D 2分及以下 原因： \"]",1},
						{3,"您最喜欢近期版本更新的哪个功能模块？","[\"A 扫矿验证\",\"B 荣耀生存\",\"C 新金币车\",\"D 其他 请填写\"]",1},
						{4,"您最讨厌近期版本更新的哪个功能模块？","[\"A 扫矿验证\",\"B 荣耀生存\",\"C 新金币车\",\"D 其他 请填写\"]",1},
						{5,"您为什么讨厌该模块？","[\"A 原因：\"]",1},
						{6,"您的手机操作系统是什么？","[\"A ios\",\"B 安卓 \"]",0},
						{7,"test","[\"A ios\",\"B 安卓 \",\"C 塞班\"]",0},
						{8,"您的对游戏还有哪些意见请填写反馈给我们哦~",nil,1}
		}
}