return {
	title={"id","type","scope","eid","isDefault","unLockLv","icon","desc","showTank"},
		records={
						{101,1,-1,1,1,nil,"a_e_101","坦克默认攻击特效","[21,1]"},
						{102,1,-1,2,0,10,"a_e_102","寒冰风暴，冻住，不许走！","[21,1]"},
						{201,2,-1,1,1,nil,"a_e_201","战车默认攻击特效","[22,2]"},
						{202,2,-1,2,0,10,"a_e_202","寒冰风暴，冻住，不许走！","[22,2]"},
						{301,3,-1,1,1,nil,"a_e_301","火炮默认攻击特效","[23,3]"},
						{302,3,-1,2,0,10,"a_e_302","寒冰风暴，冻住，不许走！","[23,3]"},
						{401,4,-1,1,1,nil,"a_e_401","火箭默认攻击特效","[24,4]"},
						{402,4,-1,2,0,10,"a_e_402","寒冰风暴，冻住，不许走！","[24,4]"}
		}
}