return {
	title={"keyid","backtime","day","buffId","buffTime","desc"},
		records={
						{1001,7,1,45,2,"回归玩家获得2%的回归人物经验加成"},
						{1002,7,2,46,2,"回归玩家获得20%编制经验加成"},
						{1003,7,3,47,2,"回归玩家获得5种资源50%的基础产量"},
						{1004,14,1,45,3,"回归玩家获得2%的回归人物经验加成"},
						{1005,14,2,46,3,"回归玩家获得20%编制经验加成"},
						{1006,14,3,47,3,"回归玩家获得5种资源50%的基础产量"},
						{1007,21,1,45,5,"回归玩家获得2%的回归人物经验加成"},
						{1008,21,2,46,5,"回归玩家获得20%编制经验加成"},
						{1009,21,3,47,5,"回归玩家获得5种资源50%的基础产量"},
						{1010,28,1,45,7,"回归玩家获得2%的回归人物经验加成"},
						{1011,28,2,46,7,"回归玩家获得20%编制经验加成"},
						{1012,28,3,47,7,"回归玩家获得5种资源50%的基础产量"}
		}
}