return {
	title={"id","name","effectId","durationTime","appointNum","buffType","_desc"},
		records={
						{1,"讨伐官",31,86400,3,1,"增加带兵量：10"},
						{2,"工程官",23,86400,3,1,"建筑建筑速度+5%"},
						{3,"研发官",24,86400,3,1,"科技研发速度+5%"},
						{4,"改造官",25,86400,3,1,"生产改造坦克速度+5%"},
						{5,"财务官",26,86400,3,1,"每小时获得10金币（任命时间结束时，统一发送）"},
						{6,"开采官",28,86400,3,1,"部队开采速度提高+5%"},
						{101,"要塞门童",127,43200,6,2,"部队行军速度降低50%"},
						{102,"要塞脚夫",123,43200,6,2,"建筑建造速度降低10%"},
						{103,"要塞苦力",125,43200,6,2,"生产改造坦克速度降低10%"},
						{104,"要塞长工",129,43200,6,2,"资源生产速度降低10%"},
						{105,"过气军神",122,43200,6,2,"带兵量降低10"},
						{106,"过气武神",128,43200,6,2,"部队开采速度降低10%"}
		}
}