return {
	title={"id","name","value","desc"},
		records={
						{1,"荣耀生存开启时间",30,"开服30天开启"},
						{2,"每月开启时间","5,20","每月5号，20号开启"},
						{3,"玩法开启时间点","00:00","0点开启"},
						{4,"玩法持续时间",2880,"单位分钟"},
						{5,"玩法各阶段开始时间","[[60,420],[480,720],[780,1020],[1080,1260]]","每个缩圈阶段的开始和结束时间轴"},
						{6,"每个阶段的半边长","200,100,50,15","每个圈阶段的半边长"},
						{7,"个人排行榜上榜积分要求",10000,"个人积分达到200才能上榜"},
						{8,"军团排行榜上榜积分要求",25000,"军团积分达到300才能上榜"},
						{9,"累计采集60分钟才可获得金币",60,"最后一圈安全区内才可获得金币"},
						{10,"每个玩法周期掠夺获得金币上限",600,"通过掠夺最多可获得600金币"},
						{11,"个人积分＞0才可领取军团排名奖励",1,"个人积分＞0才可领取军团排名奖励"}
		}
}