return {
	title={"kid","id","name","ifPieces","maxProduceTime","amountPmm","personLimit","minP","revertPrice","description","picture"},
		records={
						{1,101,"科技粒子",1,14400,5,40,1,0,"用于合成科技粒子","lab_lizi"},
						{2,102,"智子颗粒",1,14400,5,30,1,0,"用于合成超级智子","lab_yunshi"},
						{3,103,"元件晶块",1,14400,5,20,1,0,"用于合成未来元件","lab_dianchi"},
						{4,104,"能量粉末",1,14400,5,20,3,0,"用于合成聚变能源","lab_tuliao"},
						{5,201,"科技粒子",0,0,0,0,0,20,"通过尖端科技从精矿物质中提取出的新粒子，作战实验室中的基础消耗品","lab_lizi"},
						{6,202,"超级智子",0,0,0,0,0,30000,"收集太空陨石熔合而出的材料，具有超高的强度和抗疲劳能力。在实验室中拥有广泛的用途","lab_yunshi"},
						{7,203,"未来元件",0,0,0,0,0,500000,"使用电化学反应进行发电的元件，高效率低污染，用于实验室的中高端科技研究","lab_dianchi"},
						{8,204,"聚变能源",0,0,0,0,0,1000000,"掌握了核聚变后生产的类聚变能源，具有超高级别能量。主要用于研究高端科技，以及制造车间内部分图纸的制造","lab_tuliao"}
		}
}