return {
	title={"kid","id","name","type","ifUnlock","preBuilding","itemConsume","addProduceTime","description","picture"},
		records={
						{1,101,"粒子萃取室",1,1,"[]","[]",0,"从精矿物质中萃取粒子的建筑，生产科技粒子","lab_lizicuiqushi"},
						{2,102,"陨石加工所",1,0,"[101]","[[38,201,700000],[5,575,5]]",0,"生产熔合陨石材料的建筑，生产智子颗粒","lab_yunshijiagongsuo"},
						{3,103,"晶块工厂",1,0,"[102]","[[38,201,1400000],[38,202,2600],[5,575,5]]",0,"通过电化学反应制造晶块的建筑，生产元件晶块","lab_dianchigongchang"},
						{4,104,"聚变反应炉",1,0,"[103]","[[38,201,2100000],[38,202,3300],[38,203,290],[5,575,5]]",0,"使用聚变反应产生的巨额能量加工粉末的建筑，生产能量粉末","lab_tuliaogongfang"},
						{5,201,"粒子仓库",2,0,"[101]","[[38,201,3500000],[38,204,34],[5,576,5]]",14400,"提高科技粒子离线生产时间4h","lab_lizicangku"},
						{6,202,"智子仓库",2,0,"[102]","[[38,202,3900],[38,204,34],[5,576,5]]",14400,"提高超级智子离线生产时间4h","lab_yunshicangku"},
						{7,203,"元件仓库",2,0,"[103]","[[38,203,290],[38,204,34],[5,576,5]]",14400,"提高元件晶块离线生产时间4h","lab_dianchicangku"},
						{8,204,"能源仓库",2,0,"[104]","[[38,204,69],[5,576,5]]",14400,"提高聚变能源离线生产时间4h","lab_tuliaocangku"},
						{9,301,"巨型仓库",3,0,"[201,202,203,204]","[[38,201,5600000],[38,202,3900],[38,203,290],[5,577,5]]",28800,"提高所有材料离线生产时间8h","lab_juxingcangku"}
		}
}