return {
	title={"id","name","type","quality","icon","dec"},
		records={
						{1,"洗涤剂",1,2,"medal_matrial_1","用于勋章升级。分解高品质勋章可获得"},
						{2,"研磨石",1,2,"medal_matrial_2","用于勋章升级。"},
						{3,"抛光材料",2,3,"medal_matrial_3","勋章打磨必需的珍稀材料之一"},
						{4,"保养油",2,4,"medal_matrial_4","勋章打磨必需的珍稀材料之一"},
						{5,"打磨工具",2,5,"medal_matrial_5","勋章打磨必需的珍稀材料之一"},
						{6,"精密仪器",3,5,"medal_matrial_6","用于精密操作的仪器，贵重而精致。勋章精炼的必需品之一。"},
						{7,"神秘石",3,4,"medal_matrial_7","神秘小石块，材质不明，但蕴含大量能量。勋章精炼的必需品之一。"},
						{8,"刚玉磨料",2,4,"medal_matrial_8","勋章打磨+6以上必需的珍稀材料之一"},
						{9,"惰性气体",2,5,"medal_matrial_9","勋章完成最终打磨所需的材料，非常珍贵"}
		}
}