return {
	title={"id","name","quality","icon","dec"},
		records={
						{1,"零件",3,"material_1","改造配件的材料，进行改造所必备材料"},
						{2,"记忆金属",4,"material_2","增加配件强化成功率5%"},
						{3,"设计蓝图",4,"material_3","改造配件的材料，充满智慧与工艺的美德"},
						{4,"金属矿物",4,"material_4","改造配件的材料，含有大量金属元素的矿物"},
						{5,"改造工具",4,"material_5","改造配件的材料，没有工具将无法完成改造"},
						{6,"改造图纸",4,"material_6","改造时不降低配件强化等级"},
						{7,"坦克驱动",5,"material_7","坦克紫色配件进阶为橙色的必须材料"},
						{8,"战车驱动",5,"material_8","战车紫色配件进阶为橙色的必须材料"},
						{9,"火炮驱动",5,"material_9","火炮紫色配件进阶为橙色的必须材料"},
						{10,"火箭驱动",5,"material_10","火箭紫色配件进阶为橙色的必须材料"},
						{11,"钛合金",4,"material_11","改造配件的材料+5和+6所必备的材料"},
						{12,"纳米芯片",5,"material_12","所有配件完成最终改造都需要的材料，十分珍贵"}
		}
}