CommonText = {}

CommonText.item = {[1] = {"金币", "金币"}, [2] = {"铁", "铁矿"}, [3] = {"石油", "石油"}, [4] = {"铜", "铜矿"}, [5] = {"钛", "钛矿"}, [6] = {"水晶", "水晶", "用于研发科技、修理坦克、提升资历等"},
[7] = {"设计蓝图", "改造配件的材料\n充满智慧与工艺美德"},
[8] = {"金属矿物", "改造配件的材料\n含有大量金属元素的矿物"},
[9] = {"改造工具", "改造配件的材料\n没有工具将无法完成改造"},
[10] = {"零件", "改造配件的材料\n进行改造所必备材料"},
[11] = {"记忆金属", "增加配件强化成功率:5%"},
[12] = {"改造图纸", "改造时不降低配件强化等级"},
[13] = {"竞技场积分"},
[14] = {"统率等级", "技能等级", "装备品质", "装备升级", "配件品质", "配件强化", "配件改造", "科技等级", "军团科技", "主力部队", "部队满编", "繁荣等级"},
[15] = {"荒宝碎片"},
[16] = {"功勋"},
[17] = {"编制经验"},
[18] = {"跨服积分"},
[19] = {"珈蓝矿石"},
}
CommonText.week = {[1] = "周一",[2] = "周二",[3] = "周三",[4] = "周四",[5] = "周五",[6] = "周六",[0] = "周日"}
CommonText.color = {[1] = {"白", "白色"}, [2] = {"绿", "绿色"}, [3] = {"蓝", "蓝色"}, [4] = {"紫", "紫色"}, [5] = {"橙", "橙色"}, [6] = {"红", "红色"}}

CommonText.attr = {"攻击", "生命", "载重", "命中", "闪避", "暴击", "抗暴", "穿刺", "防护", "克制", "光环", "爆裂","坚韧", "震慑", "刚毅"}
CommonText.atkMode = {"横排攻击", "竖排攻击", "全军攻击", "单一攻击"}

CommonText.num = {"一", "二", "三", "四", "五", "六", "七", "八", "九", "十"}

CommonText.WeekActivity = {}
CommonText.WeekActivity[1] = {"每日福利","半价限购","七天活动","七日冲级","亲爱的指挥官："}
CommonText.WeekActivity[2] = {"第一天","第二天","第三天","第四天","第五天","第六天","第七天"}
CommonText.WeekActivity[3] = {"指挥中心","副本星数","战车工厂等级","装备收集","科研中心","坦克制造","资源建筑","竞技排名","科技等级","资源采集","基地繁荣","统率等级","提升战力","技能等级"}
CommonText.WeekActivityTip = {"活动指南","第七天可获得紫色攻击装备","每日活动预览","第%d天"}
CommonText.WeekActivityAward = "领奖倒计时:"
CommonText.WeekActivityCom = "是否花费%d%s抢购"

CommonText[1] = "确定"
CommonText[2] = "取消"
CommonText[3] = "基地"
CommonText[4] = "关卡"
CommonText[5] = "部队"
CommonText[6] = "背包"
CommonText[7] = "装备"
CommonText[8] = "社交"
CommonText[9] = "邮件"
CommonText[10] = "设置"
CommonText[11] = "配件"
CommonText[12] = "设置部队"
CommonText[13] = "执行任务"
CommonText[14] = "修理坦克"
CommonText[15] = "设置阵型"
CommonText[16] = "已保存阵型"
CommonText[17] = "最大战力"
CommonText[18] = "出战"
CommonText[19] = "设置防守"
CommonText[20] = "行军目标"
CommonText[21] = "行军时间"
CommonText[22] = "带兵数量"
CommonText[23] = "部队载重"
CommonText[24] = "基础战力"
CommonText[25] = "装备战力"
CommonText[26] = "将领战力"
CommonText[27] = "技能科技"
CommonText[28] = "配件战力"
CommonText[29] = "全部修复"
CommonText[30] = "修复"
CommonText[31] = "保存阵型"
CommonText[32] = "敌军阵型"
CommonText[33] = "战力"
CommonText[34] = "挑战"
CommonText[35] = "扫荡"
CommonText[36] = "获得三星评级可进行关卡扫荡"
CommonText[37] = "经验"
CommonText[38] = "可能掉落"
CommonText[39] = "省流量不看战斗"
CommonText[40] = "数量"
CommonText[41] = "增加"
CommonText[42] = "选择部队"
CommonText[43] = "征战"
CommonText[44] = "探险"
CommonText[45] = "限时"
-- CommonText[46] = ""
CommonText[47] = "（征战可获得大量经验、有几率获得技能书）"
CommonText[48] = "要求"
CommonText[49] = "通过"
CommonText[50] = "开启"
CommonText[51] = "指挥官"
CommonText[52] = "阵型"
CommonText[53] = "小提示"
-- CommonText[54] = "可以拖拽移动交换部队"
-- CommonText[55] = "(成为VIP能出战更多部队)"
CommonText[56] = "关卡收益"
CommonText[57] = "关卡评级"
CommonText[58] = "添加坦克"
CommonText[59] = "部署防守阵型完毕"
CommonText[60] = "最大载重"
CommonText[61] = "类别"
CommonText[62] = "需求"
CommonText[63] = "当前拥有"
-- CommonText[64] = "没有设置套用阵型"
CommonText[64] = "功能尚未开启，敬请期待"
CommonText[65] = "不足，无法升级"
CommonText[66] = "不足，无法修复"
CommonText[67] = "覆盖"
CommonText[68] = "读取"
CommonText[69] = "成为VIP专享特权Buff大幅缩减建造和生产时间"
CommonText[70] = "建造"
CommonText[71] = "生产"
CommonText[72] = "生产中"
CommonText[73] = "当前"
CommonText[74] = "下一级"
CommonText[75] = "每小时生产五种资源"
CommonText[76] = "提供资源容量"
CommonText[77] = "每级%s可增加"
CommonText[78] = {"繁荣", "繁荣度"}
CommonText[79] = "升级"
CommonText[80] = "金币升级"
CommonText[81] = "立即升级"
CommonText[82] = "加速"
CommonText[83] = "点"
CommonText[84] = "成功使用"
CommonText[85] = "物品使用"
CommonText[86] = "使用"
CommonText[87] = "购买使用"
CommonText[88] = "使用后可获得"
CommonText[89] = "加速生产"
CommonText[90] = "建筑加速"
CommonText[91] = "一键"
CommonText[92] = "%s等级不足，是否前往升级%s？"
CommonText[93] = "金币建造"
CommonText[94] = "已完成，无需加速"
CommonText[95] = "当前数量"
CommonText[96] = "需要"
CommonText[97] = "%s达到%d级"
CommonText[98] = "角色"
CommonText[99] = "返回"
CommonText[100] = "取消生产会扣除部分资源和道具，是否确定？"
CommonText[101] = "玩家信息"
CommonText[102] = "详情"
CommonText[103] = "技能"
CommonText[104] = "头像"
CommonText[105] = "军团"
CommonText[106] = "荣誉"
CommonText[107] = "能量"
CommonText[108] = "无"
CommonText[109] = "请挑战据点"
CommonText[110] = {"声望", "声望值"}
CommonText[111] = "每天可领取"
CommonText[112] = "是否花费%d金币购买%d点%s?"
CommonText[113] = "等级"
CommonText[114] = "统率"
CommonText[115] = "授勋"
CommonText[116] = "每天可授勋%d次，授勋可以获得"
CommonText[117] = "花费"
CommonText[118] = "重置"
CommonText[119] = "购买"
CommonText[120] = "个"
CommonText[121] = "技能书"
CommonText[122] = "系统头像"
CommonText[123] = "普通头像"
CommonText[124] = "头像挂件"
CommonText[125] = "部队装备"
CommonText[126] = "已装备"
CommonText[127] = "第%d部队穿戴中"
CommonText[128] = "每级增加%s部队%s。"
CommonText[129] = "当前没穿戴装备"
CommonText[130] = "装备仓库"
CommonText[131] = "装备卸下成功"
CommonText[132] = "装备查看"
CommonText[133] = "更换"
CommonText[134] = "卸下"
CommonText[135] = "增益"
CommonText[136] = "扩充"
CommonText[137] = "穿戴"
CommonText[138] = "出售"
CommonText[139] = "容量"
CommonText[140] = "确定花费%d金币增加%d个容量吗？"
CommonText[141] = "全选"
CommonText[142] = "已选数量"
CommonText[143] = "出售可获"
CommonText[144] = "退出"
CommonText[145] = "确定出售"
CommonText[146] = "请选择要出售的装备"
CommonText[147] = "请选择要消耗的装备"
CommonText[148] = "研究"
CommonText[149] = "我的物资"
CommonText[150] = "商城"
CommonText[151] = "物资"
CommonText[152] = "所有"
CommonText[153] = "资源"
CommonText[154] = "其他"
CommonText[155] = "仓库储备"
CommonText[156] = {"当前可保护每种资源", "不被掠夺"}
CommonText[157] = {"可被掠夺", "完全保护", "爆仓停产"}
CommonText[158] = "产量"
CommonText[159] = {"秒", "分", "小时", "天", "分钟"}
CommonText[160] = "增加属性"
CommonText[161] = "配件探险"
CommonText[162] = {"坦克", "战车", "火炮", "火箭"}
CommonText[163] = "碎"
CommonText[164] = "碎片"
CommonText[165] = "材料"
CommonText[166] = "批量分解"
CommonText[167] = "点击可按配件品质进行批量分解"
CommonText[168] = "指挥官达到%d级开启该配件位"
CommonText[169] = "仓库"
CommonText[170] = "配件查看"
CommonText[171] = "分解"
CommonText[172] = "卸下"
CommonText[173] = "强化"
CommonText[174] = "改造"
CommonText[175] = "装配"
CommonText[176] = "加成"
CommonText[177] = "适用兵种"
CommonText[178] = "改造等级"
CommonText[179] = "强化等级"
CommonText[180] = "配件卸下成功"
CommonText[181] = "成功几率"
CommonText[182] = "强化消耗"
CommonText[183] = "强化有可能失败"
CommonText[184] = "使用%s可增加成功率"
CommonText[185] = "改造消耗"
CommonText[186] = "改造会降低%d级强化等级"
CommonText[187] = "改造保证"
CommonText[188] = "使用%s可保证不降低强化等级"
CommonText[189] = "请选择要分解的配件品质"
CommonText[190] = "请选择要分解的碎片品质"
CommonText[191] = "点击可按碎片品质进行批量分解"
CommonText[192] = "没有需要修复的坦克"
CommonText[193] = "阵型是空的，请设置阵型"
CommonText[194] = "没有足够的坦克填充阵型"
CommonText[195] = "成功读取阵型"
CommonText[196] = "取消建造值返还部分资源，确定要取消建造吗？"
CommonText[197] = "当前%s已满"
CommonText[198] = "售价"
CommonText[199] = "不足，无法购买"
CommonText[200] = "成功购买"
CommonText[201] = "确定要花费%d个%s加速建造吗？"
CommonText[202] = "制作"
CommonText[203] = "制作中"
CommonText[204] = "物资生产"
CommonText[205] = "资源不足，无法生产"
CommonText[206] = "改装"
CommonText[207] = "可改装数量"
CommonText[208] = "装备升级材料:提供%d经验值。"
CommonText[209] = "本次提升"
CommonText[210] = "仓库中的装备"
CommonText[211] = "碎片查看"
CommonText[212] = "%d个可合成,%s[适用%s]"
CommonText[213] = "获取"
CommonText[214] = "合成"
CommonText[215] = "分解预览"
CommonText[216] = "分解后可获得以下材料"
CommonText[217] = "不足，无法强化"
CommonText[218] = "不足，无法改造"
CommonText[219] = "强化成功"
CommonText[220] = "强化失败"
CommonText[221] = "改造成功"
CommonText[222] = "改造失败"
CommonText[223] = "不足"
CommonText[224] = "强化最高等级"
CommonText[225] = "改造最高等级"
CommonText[226] = "回放录像"
CommonText[227] = "继续战斗"
CommonText[228] = "我方出阵坦克"
CommonText[229] = "敌方出阵坦克"
CommonText[230] = "获得奖励"
CommonText[231] = "损兵"
CommonText[232] = "小贴士: 打关卡有几率获得"
CommonText[234] = "跳过"
CommonText[235] = "提升坦克战力吧"
CommonText[236] = "当前进度"
CommonText[237] = {"第", "关", "次", "级", "件", "辆", "名", "高"}
CommonText[238] = "%s不足，是否花费%d个%s进行统率提升？"
CommonText[239] = {"一星授勋", "三星授勋", "五星授勋", "元首授勋"}
CommonText[240] = "提升资历需指挥官等级达到%d级"
CommonText[241] = "是否花费%d%s增加挑战次数(%d次)?"
CommonText[242] = "今日挑战次数已完成，请下次挑战"
CommonText[243] = "拆除"
CommonText[244] = "你确定要拆除该建筑吗？"
CommonText[245] = "指挥官等级不足"
CommonText[246] = "是否花费%d%s重置技能?(重置后技能等级置0.返还全部%s)"
CommonText[247] = "玩家自己"
CommonText[248] = "阵型战力"
CommonText[249] = "挑战次数"
CommonText[250] = "连胜次数"
CommonText[251] = "当前积分"
CommonText[252] = "上期排名"
CommonText[253] = "挑战记录"
CommonText[254] = "积分兑换"
CommonText[255] = "领取奖励"
CommonText[256] = "每天0点时结算竞技场排名(前500名可获得奖励)"
CommonText[257] = "第%s名奖励"
CommonText[258] = "排名奖励"
CommonText[259] = "我的昨天排名"
CommonText[260] = "确定花费%d%s购买一次挑战次数吗？"
CommonText[261] = "驻守本城"
CommonText[262] = "增益信息"
CommonText[263] = "资源增益"
CommonText[264] = "VIP特权"
CommonText[265] = "战斗"
CommonText[266] = "成长"
CommonText[267] = {"(增益中 产量+%d%% %s)", "(丰收中 产量+%d%% %s)"}
CommonText[268] = "排行"
CommonText[269] = "奖励预览"
CommonText[270] = "特殊奖励"
CommonText[271] = "点击据点开始挑战"
CommonText[272] = "剩余挑战次数"
CommonText[273] = "通关条件"
CommonText[274] = "通关奖励"
CommonText[275] = "剩余次数"
CommonText[276] = "排行榜"
CommonText[277] = "全面歼敌"
CommonText[278] = "可能获得"
CommonText[279] = "军衔不足"
CommonText[280] = "请设置竞技场阵型"
CommonText[281] = "战斗力"
CommonText[282] = "次数"
CommonText[283] = "挑战次数已用完，请明儿再来挑战"
CommonText[284] = "继续扫荡"
CommonText[285] = "停止扫荡"
CommonText[286] = "获得物品"
CommonText[287] = "修理扣除"
CommonText[288] = "损耗和扣除坦克"
CommonText[289] = "扫荡结束"
CommonText[290] = "指挥官达到%d级开启%s"
CommonText[291] = "探险记事"
CommonText[292] = "挑战次数已用完"
CommonText[293] = "我的积分"
CommonText[294] = "兑换"
CommonText[295] = "兑换成功"
CommonText[296] = "竞技场战报"
CommonText[297] = {"个人", "全服"}
CommonText[298] = "加速生产会扣除%d%s,是否确定?"
CommonText[299] = {"扫荡挑战失败，停止扫荡", "扫荡结束，可滑动查看奖励", "挑战次数不足，停止扫荡", "正在努力扫荡中...", "无法满足坦克修复，停止扫荡", "阵型损失太大，停止扫荡", "是否确定停止扫荡? (至少完成一个关卡扫荡才会有奖励获得)"}
CommonText[300] = "停止扫荡"
CommonText[301] = "挑战次数不足，无法扫荡"
CommonText[302] = "是否花费%d点%s重置，从第一关开始挑战?"
CommonText[303] = "我的进度"
CommonText[304] = "从第%d关扫荡到第%d关?"
CommonText[305] = "坐标"
CommonText[306] = "查找附近"
CommonText[307] = "当前战斗力"
CommonText[308] = "目标信息"
CommonText[309] = "保存"
CommonText[310] = "是否消耗%s%s，执行今日第%d次侦查？"--"是否花费%d%s对该地区进行侦查？"
CommonText[311] = {"是否使用%s%s迁徙基地到(%d,%d)吗？", "你确定要随机迁徙主城吗？"}
CommonText[312] = {"确定需要花费%d%s购买一个%s发布公告吗？", "确定使用一个%s发布公告吗？"}
CommonText[313] = {"", "", "将领分享", "收藏", "侦查", "攻击"}
CommonText[314] = {"军团驻地", "进入基地"}
CommonText[315] = "确定需要花费%d%s购买吗？"
CommonText[316] = "部队详情"
CommonText[317] = "确定花费%d%s加速吗？"
CommonText[318] = "部队状态"
CommonText[319] = "行军剩余时间"
CommonText[320] = {"行军中", "返回中", "采集中", "驻军中", "采集结束", "待命中"}
CommonText[321] = "采集未满，是否确定返回"
CommonText[322] = {"游戏设置", "账号切换", "安全锁设置", "联系我们"}
CommonText[323] = "游戏性"
CommonText[324] = "通知"
CommonText[325] = {"背景音乐", "按键音效", "自动补充防御部队", "消费二次确认", "显示建筑名称", "活动开启[副本/团战]", "建筑升级完成", "生产完成[科技/坦克]", "能量满通知","给游戏一点建议以及评分"}
CommonText[326] = {"(已开启)", "(已关闭)", "开启", "关闭"}
CommonText[327] = "设置"
CommonText[328] = {"客服电话", "4000274365", "客服邮箱", "kefu@anfan.com", "官方交流群", "327323221"}
CommonText[329] = {"战力榜", "关卡榜", "荣誉榜", "攻击强化", "暴击强化", "闪避强化", "竞技场", "极限副本", "编制榜", "震慑强度", "刚毅强度", "勋章价值", "勋章展示","军衔榜","总实力榜"}
CommonText[330] = {"战斗力排行榜", "关卡排行榜", "荣誉排行榜",  "攻击强化排行榜", "暴击强化排行榜", "闪避强化排行榜", "竞技场排行榜", "", "编制排行榜", "勋章震慑强度排行榜", "勋章刚毅强度排行榜", "勋章总价值排行榜", "勋章展示排行榜","军衔排行榜","总实力排行榜"}
CommonText[331] = "每小时可生产每种资源"
CommonText[332] = "提供每种资源容量"
CommonText[333] = {"每级提高科技研发速度", "升级可研发更多、更高等级的科技", "提高科技研发速度"}
CommonText[334] = {"可制作部分在商城有出售的道具"}
CommonText[335] = {"提高所有资源容量，并保护这部分不被掠夺"}
CommonText[336] = {"每级提升作战单位生产速度", "可生产作战单位部队", "作战单位生产速度"}
CommonText[337] = {"每级提升改装速度", "将低级作战单位改装为高级作战单位", "提高作战单位改装速度"}
CommonText[338] = {"每小时可生产", "同时提供", "容量", "可生产"}
CommonText[345] = {"可获得装备升级材料", "可获得配件和改造材料", "可获得%s\n", "玩法开放时间(每周二四六全天开放)","可获得军工科技材料","","","可获得能晶","可获得勋章", "玩法开放时间(每周%s全天开放)"}
CommonText[346] = "资历提升成功"
CommonText[347] = "资源信息"
CommonText[348] = "兵力信息"
CommonText[349] = {"侦察地点", "侦察时间", "据点坐标", "所属军团", "据点驻军"}
CommonText[350] = {"驻守后，每小时可采集", "资源，直到部队负重满。", "已采资源", "最多可掠夺"}
CommonText[351] = "提升VIP等级，才可以购买更多建造位"
CommonText[352] = {"空闲"}
CommonText[353] = "点击这里说话，最多40个字"
CommonText[354] = {"世界", "军团", "客服", "私聊","跨服","跨服"}
CommonText[355] = {"内容不能为空", "字数不能超过40", "角色不存在或者不在线", "内容不合法"}
CommonText[356] = "聊天"
CommonText[357] = "搜索"
CommonText[358] = "输入要私聊玩家的名字进行私聊"
CommonText[359] = {"管理你的基地", "建造资源建筑", "搜索敌人并发起攻击"}
CommonText[360] = {"奖励", "奖", "励"}
CommonText[361] = {"敌军来袭"}
CommonText[362] = "即将来袭"
CommonText[363] = {"攻击目标", "我方基地"}
CommonText[364] = "查看部队"
CommonText[365] = "驻军"
CommonText[366] = {"提升VIP等级，才可以购买更多次数", "提升VIP等级，才可以执行更多任务", "提升VIP等级，才可以执行更多生产", "提升VIP等级，才可以扫荡"}
CommonText[367] = {"设置驻军成功", "遣返军团驻军成功"}
CommonText[368] = "资源不足，无法改装"
CommonText[369] = "充值"
CommonText[370] = {"再充值", "可成为"}
CommonText[371] = "未知"
CommonText[372] = "修复成功"
CommonText[373] = "建造成功"
CommonText[374] = {"统率提升成功", "统率提升失败"}
CommonText[375] = "花费金币加速成功"
CommonText[376] = {"首次通关", "最近通关"}
CommonText[377] = "下级"
CommonText[378] = "升级需要"
CommonText[379] = {"当前等级", "下一等级"}
CommonText[380] = "编制经验"
CommonText[381] = "获得"
CommonText[382] = {"设置成功", "VIP等级不足，无法设置头像", "指挥官等级不足，无法设置头像", "VIP等级不足！"}
CommonText[383] = "选择类别"
CommonText[384] = "收藏成功"
CommonText[385] = "世界尽头"
CommonText[386] = {"繁荣等级作用:增加带兵量(9级以上加成编制经验获得量)", "等级提升方法:升级建筑增加繁荣度.提升繁荣等级",
"繁荣等级玩法",
"(1)攻击他人基地取得胜利.能降低对方繁荣度(VIP等级越高，扣除繁荣度越多)",
"(2)繁荣度变低会导致繁荣等级下降.影响带兵",
"(3)基地变为废墟时.还会引发大量惩罚：载重减少.资源减产.恢复速度变慢等",
"当繁荣度低于繁荣上限时", "(1)非废墟每分钟恢复1点繁荣度，废墟每2分钟恢复1点繁荣度", "(2)攻击他人可恢复繁荣度(繁荣等级越高，恢复等级越快)", "(3)使用少量金币恢复满繁荣"}
CommonText[387] = {"高级统率可增加带兵量.消耗统率书能提升统率等级"}
CommonText[388] = {"声望等级越高.可提升的科技等级越高。", "获取声望值途径：",
"1.每天首次登陆赠送（资历越高，赠送越多）",
"2.完成任务",
"3.授勋（每天1次，获取大量声望值）"}
CommonText[389] = {"每级增加所有部队", "可从日常任务获得"}
CommonText[390] = {"1.配件可通过探险配件关卡获得",
"2.配件能够增加兵种属性：攻击、生命、穿刺和防护：",
"  穿刺：增加己方部队伤害结果",
"  防护：减少敌方部队伤害结果",
"3.配件可进行强化.提升配件属性数值",
"4.配件可进行改造，极大提升配件属性数值",
"改造材料可通过探险配件关卡获得",
"5.蓝紫色配件需要通关碎片合成获得",
"6.橙色配件需通过紫色配件进阶获得",
"7.无用的配件和碎片可进行分解，分解获得改造材料"}
CommonText[391] = "我的排名"
CommonText[392] = "未上榜"
CommonText[393] = "倒计时"
CommonText[394] = "扫荡中..."
CommonText[395] = "扫荡奖励"
CommonText[396] = {"排名", "角色名", "等级", "星数", "攻击加成", "暴击加成", "闪避加成", "阵型战力", "编制称号", "编制等级", "勋章总价值", "展示数量","军衔","总实力"}
CommonText[397] = {"购买道具需要的游戏币；通过充值获取", "增加声望经验，提升指挥官的声望等级", "用于兑换竞技场商店道具;通过竞技场玩法获得。", "军演获得，用于军演商店兑换奖励","矿区的采集和战斗能获得编制经验，编制经验能提升编制等级。","出动军队攻打关卡、矿点、玩家会消耗能量,能量会随着时间自然回复。","跨服活动获得的积分，可兑换各种珍贵物品", "珍贵的矿石，用于在挑战关卡的神秘商店处兑换奖励"}
CommonText[398] = {"副本奖励", "累计获得", "可领取", "损兵低于10%，即可获得三星评价"}
CommonText[399] = "CD时间未结束"
CommonText[400] = {"发送公告", "请输入要发送的内容"}
CommonText[401] = {"攻打", "增加", "减少", "伤害"}
CommonText[402] = "换一批"
CommonText[403] = "聊天屏蔽列表"
CommonText[404] = {"屏蔽人数", "屏蔽", "取消屏蔽", "屏蔽人数已满"}
CommonText[405] = {"确定屏蔽[%s]的聊天信息吗?", "确定取消屏蔽[%s]的聊天信息吗?"}
CommonText[406] = "分享成功"
CommonText[407] = "容量增加"
CommonText[408] = "特权"
CommonText[409] = "仓库容量已最大，无法继续扩容"
CommonText[410] = "报告已删除"
CommonText[411] = "未开启"
CommonText[413] = {"当前激活套装效果", "套装列表", "全部属性加成", "激活"}
CommonText[414] = {"蓝色套装", "紫色套装"}
CommonText[415] = {"神秘商店", "获得的奖励可在神秘商店中兑换神秘道具"}
CommonText[416] = "战斗力排名"
CommonText[417] = "(每5分钟刷新)"
CommonText[418] = "提升战斗力途径"
CommonText[419] = {"装备可升级", "装备不可升级", "配件可强化", "配件不可强化", "配件可改造", "配件不可改造"}
CommonText[420] = "仓库中的配件"
CommonText[421] = {"今日可捐献科技", "你还没有军团，赶快加入军团!"}
CommonText[422] = {"有可升级战斗科技", "科技馆等级过低，马上前往升级"}
CommonText[423] = "可提升建筑等级增加繁荣度"
CommonText[424] = "最强制作坦克"
CommonText[425] = "还差"
CommonText[426] = "兵贵多.继续生产和改装吧!"
CommonText[427] = "确定消耗%d个%s购买一个建筑位吗?"
CommonText[428] = {"确定花费%d个%s购买繁荣度吗?","确定花费%d个%s脱离废墟吗？"}
CommonText[429] = "批量使用"
CommonText[430] = "攻击他人后免战状态会消失。确定攻击吗？"
CommonText[431] = "要塞"
CommonText[432] = "炮火纷飞的要塞争夺战即将打响"
CommonText[433] = {"选取要塞之主的“要塞争夺战”即将打响，争夺象征实力与权力的领主之位", "要塞之主需要绝对的实力，军团的团结，深邃的智慧……", "要塞之主拥有无尽的财富，绝对的权力，至高的荣誉……", "你，有资格成为要塞之主吗？"}
CommonText[434] = "兑换码"
CommonText[435] = {"请输入兑换码"}
CommonText[436] = {"此类型兑换码已使用", "兑换码不存在", "此兑换码已使用", "兑换码无效", "时效性已过", "错误的渠道类型"}
CommonText[437] = "兑换码使用成功"
CommonText[438] = "活动"
CommonText[439] = {"指挥官达到指定等级可领取丰厚奖励。\n奖励有: 金币、统率书和技能书。\n升级途径: 打关卡、做任务。",
"在世界上攻打玩家达到指定次数，可获得丰厚奖励",
"开服第7天23:59:59对战力排名进行结算，排名前30的指挥官可领取丰收奖励",
"开服第7天23:59:59对关卡排名进行结算，排名前5的指挥官可领取丰收奖励",
"开服第7天23:59:59对荣誉排名进行结算，排名前10的指挥官可领取丰收奖励",
"活动结束时结算全服军团等级排行\n前10等级军团成员可获得奖励",
"活动期间达到以下条件可领取丰厚奖励",
"活动期间每天增加5次装备关卡探险次数",
"活动期间每天增加5次配件关卡探险次数",
"活动期间采集到指定数量的资源，可以额外领取丰厚资源奖励",  -- 10
"活动期间攻打关卡达到指定次数，即可领取技能书奖励",
"活动结束时结算全服军团战力排行\n前3战力军团的前10战力成员可获得奖励",
"活动期间玩家进行军团大厅或者科技金币捐献时，可获得60%捐献金币返还",
"全民大狂欢\n提统率、提等级、疯狂轰资源据点",
"指挥官霸业之路，一次投资长久回报!\nVIP2以上可500金币购买",
"每天充值可额外获得红包，\n可赠送其他玩家，每日数据重置。",
"开服期间，每天充值指定金币可领取奖励",
"",
"活动期间可在该界面购买以下折扣商品",
"抽装备、VIP礼包可获取紫色装备\n装备能提升出战部队的属性",  -- 20
"活动期间，升级指定数量的紫色装备到指定等级。可以领取丰厚的升级材料奖励",
"每天竞技场战胜玩家达到指定次数，可以领取丰厚奖励",
"活动期间，进阶获得指定数量的指定等阶将领可以领取丰厚奖励",
"让强化更任性!  让改造更人性!\n每天超量水晶等你抢购!",
"活动期间，在该界面购买以下道具，可享受优惠价格.",
"",
"我要任性地抽装备!",
"活动期间消费满指定金币，可以领取以下丰厚奖励！(活动期间奖励不重置)",
"你探险装备关卡，我给钱给BUFF。\n有钱就是任性",
"每天单笔充值满1000金币，返利10%\n连续7天充值达标，送紫色装备配件",  -- 30
"充值大返利，金币水晶送不停",
"每天充值满指定金币可领取奖励，每日0点重置!(请0点以前及时领取奖励)",
"活动期间可在该界面购买以下折扣商品",
"各种超值道具等你来哟，机不可失，买买买。",
"活动期间可在该界面购买以下折扣商品",
"节日期间，只要你在线，我们就赠送大量超值奖励。",
"本月份累计登录指定天数可领取丰收奖励",
"在你的强力拦截下，部分敌军愿意献上手中的军需箱，但你需要付出一点代价。",
"活动期间，能源核心和升级装备喂养装备卡获得的经验增加50%，每天海量装备卡限量低价出售。",
"活动期间攻打征服关卡有几率获得军需箱。",  -- 40
"迎新春，送祝福，每个充值档次的首次充值均可获得120%金币(含赠送)返利，活动每日重置。",
"活动期间充值累计满指定金额，可获得超值奖励！(活动期间奖励不重置)",
"",
"每天单笔充值满500金币，返利10%\n连续4天充值达标，送紫色装备箱子",
"活动期间，在该界面购买以下道具，可享受优惠价格.", --45
"你探险配件关卡，我给钱给BUFF，有钱就是任性.",
"活动期间，研发以下科技有优惠",
"捐献大厅和科技可额外获得捐献所得！活动结束后总贡献前10军团成员可领取额外大奖",
"活动期间每天增加5次军工关卡探险次数",
"你探险军工关卡，我给钱给BUFF。\n有钱就是任性", --50
"活动期间每天增加5次能晶关卡探险次数",
"你探险能晶关卡，我给钱给BUFF。\n有钱就是任性",
"",
"仅此一天，跳水大放送",--54
"活动开始第一天充值指定金币即可激活连续天数，如果未充值或者充值未达标则无法领取最终大奖",--55
"活动期间攻打征服关卡有几率获得军需箱。",--56
"在世界上攻打玩家达到指定次数，可获得丰厚奖励",
"",
"指挥官霸业之路，一次投资长久回报!\nVIP2以上可500金币购买",
"合服前七天每天登录可领丰厚的奖励",
"活动期间淬炼配件，有几率出现淬炼经验暴击的效果。每天海量钛矿限量低价出售。",
"活动期间，累计消费金币数量达到目标，即可领取大量奖励。",
"活动期间，累计充值金币数量达到目标，即可领取大量奖励。",
"活动期间，可以低价购买各种超值道具。抓紧抢购吧！",
"活动期间内，研究秘密武器将获得研究劵，研究次数越多，\n送的研究劵也就越多。(每日重置)",   --65
"活动期间内，达成目标，全服每人都能领取对应档位的奖励。",
"活动期间，在前线阵地可获得积分。积分达到要求可领取丰厚奖励。普通场每次获得1积分，高级场每次获得3积分。",
"活动期间每天增加5次勋章关卡探险次数。",
"活动期间攻打勋章探险伤害加30%\n购买探险次数价格减半。",
"", --70
"限购加速\n喜迎新年，限购加速，科技等级冲冲冲！",
"限购加速\n喜迎新年，限购加速，建筑等级冲冲冲！",
"",
"活动期间登录即领福利，助你战力\n提示更上一层楼",
"活动期间，参与百团混战可赢取额外奖励\n最强军团成员还可获得稀有奖励（奖励不可重复领取）", -- 75
"活动期间每天增加1次极限探险重置次数",
"活动期间攻打战术探险伤害加30%\n购买探险次数价格减半。",
"活动期间每天增加5次战术关卡探险次数",
"征服广阔领土，获取赫赫军功。\n活动期间，每日获得军功上限翻倍。"
}
CommonText[440] = "当前排名"
CommonText[441] = "去探险"
-- CommonText[442] = "军团列表"
CommonText[443] = "查看排行"
CommonText[444] = "玩家"
CommonText[445] = "是否花费%d个%s进行修复"
CommonText[446] = "采集进度"
CommonText[447] = "装备成功"
CommonText[448] = "交换成功"
CommonText[449] = "增加几率"
CommonText[450] = {"请输入要侦查玩家名称", "请输入要定位玩家名称", "请输入要修改的名称"}
CommonText[451] = "选择联系人"
CommonText[452] = {"军团", "最近", "收藏", "好友"}
CommonText[453] = "选择"
CommonText[454] = "点击这里发公告"
CommonText[455] = "公告"
CommonText[456] = {"兑换礼包", "首充礼包"}
CommonText[457] = "是否花费%d个%s购买%s吗?"
CommonText[458] = {"赠送", "请输入要赠送玩家名字", "不能给自己发红包哦!", "名称不能为空"}
CommonText[459] = "奖励物资正在配送中，请稍后。"
CommonText[460] = {"原    价", "惊爆价", "立刻购买", "可购买"}
CommonText[461] = "可替换任意一种碎片进行合成"
CommonText[462] = "首充双倍金币"
CommonText[463] = "马上参与"
CommonText[464] = {{"10000", "战力提升(比VIP0", "坦克、统率)"}, {"72", "小时领先(比VIP0", "3个队列)"}, {"200%", "金币返还！(即充即返)"}}
CommonText[465] = {"没有对应品质的配件", "没有对应品质的碎片", "没有对应品质的勋章", "没有对应品质的勋章碎片"}
CommonText[466] = "[适用%s]"
CommonText[467] = {"合成成功","合成失败"}
CommonText[468] = "级紫装数量"
CommonText[469] = "在线奖励"
CommonText[470] = "请选择要交换到的新位置"
CommonText[471] = {"前往竞技", "前往将领"}
CommonText[472] = "是否花费%d个%s授勋?"
CommonText[473] = {"系", "统", "公", "告"}
CommonText[474] = {"单笔充值满%s金币", "可获10%金币返还(充值后立即获得)", "每天单笔充值满%s金币可领取(连续天数:", "每日累计充值满%d金币可领取(连续天数:","每日单笔充值满%d金币可领取(连续天数:"}
CommonText[475] = "丰收喜悦"
CommonText[476] = {"活动期间强化失败.仅扣除85%水晶", "活动期间改造不降低强化等级", "超量水晶任性购", "开心强化", "无畏改造"}
CommonText[477] = "招募将领"
CommonText[478] = {"有几率获得装备升级材料", "战胜关卡有几率获得", "有几率获得军工科技升级材料","有几率获得能晶","有几率获得勋章","有几率获得战术碎片及材料"}
CommonText[479] = {"闲置装备", "升级装备"}
CommonText[480] = {"获取装备材料", "前往关卡", "抽装备"}
CommonText[481] = {"部队待命中，请指挥官下达命令!", "提升VIP等级，开启更多队列!"}
CommonText[482] = {"生产坦克", "升级装备", "升级科技", "升级将领", "升级技能"}
CommonText[483] = "小提示: 选择图标可快速进入相应界面提升坦克战力!"
CommonText[484] = "前往充值"
CommonText[485] = {"配件强化等级不能超过指挥官等级", "装备等级不能超过指挥官等级"}
CommonText[486] = "是否花费%d个%s升级建造建筑"
CommonText[487] = {"小秘书", "指挥官，我是你的小秘书"}
CommonText[488] = {"我想发展", "我要变强", "我很无聊", "我想爽爽"}
CommonText[489] = {{"司令部", "坦克工厂", "大量资源", "科技馆", "等级礼包", "登录礼包"}, {"使用装备", "高级装备", "高级坦克", "增加带兵", "技能", "高级科技"}, {"找点刺激", "厉害装备", "世界聊天", "互加好友", "设置头像", "查看排行"}, {"征战关卡", "掠夺玩家", "采集资源", "日常任务", "我的军团", "资源加速"}}
CommonText[490] = {"你野外有空地可建造", "知道了", "去建造"}
CommonText[491] = {"升级司令部.建造高级建筑", "升级你的坦克工厂吧", "建造资源，屯兵积粮", "升级这个建筑吧.等级越高越厉害", "提升科技馆.研究高级科技", "这里有个等级礼包.找一找", "每天可以领取", "勾选下面的全部", "提升全军技能", "点击升一下科技",
	"点击宝箱获得奖励", "在这里可以购买补给，获取装备哦！", "没事就到世界聊聊天", "点击下面的聊天框输入", "添加一些志同道合的人", "点击别人头像", "选择一个你喜欢的头像后确定", "好多厉害的人。你看看", "选择一个章节或者据点", "点击按钮攻击他们吧",
	"占领据点，采集资源", "接受一个日常任务", "寻找志同道合的人。一起战斗吧", "查看资源的情况。点“+”按钮看看"}
CommonText[492] = "干得不错"
CommonText[493] = "攻打该章节需指挥官资历提升至%s，是否前往提升资历？"
CommonText[494] = "小提示: 同一部位，不同坦克所需配件不一样哦！"
CommonText[495] = "设置驻军"
CommonText[496] = {"恭喜您通过新手训练营，接下来请继续努力！"}
CommonText[497] = "不再提示"
CommonText[498] = {"每日登陆奖励", "试试手气"}
CommonText[499] = {"喂养装备卡获得经验增加50%", "升级加成"}

CommonText[10001] = "购买建造位成功"
CommonText[10002] = {"部队正在执行任务，无法迁徙"}
CommonText[10003] = "去关卡"
CommonText[10004] = "去充值"
CommonText[10005] = "金币不足，无法购买"
CommonText[10006] = "有部队正在攻击他人，无法使用道具"
CommonText[10007] = "赢取返利"
CommonText[10008] = "世界BOSS"
CommonText[10009] = "伤害排名"
CommonText[10010] = "VIP自动战斗"
CommonText[10011] = {"活动状态", "我的伤害", "伤害排名", "BOSS名称", "BOSS终结者"}
CommonText[10012] = "我的伤害"
CommonText[10013] = "击杀BOSS后才可获得排名奖励"
CommonText[10014] = "祝福在重新设置阵型后生效!"
CommonText[10015] = "进度"
CommonText[10016] = {"战斗结果", "伤害总值", "本次奖励"}
CommonText[10017] = {"等待中", "结束倒计时", "准备就绪", "活动已结束"}
CommonText[10018] = "V3重装坦克"
CommonText[10019] = {"极速穿刺", "火力暴击", "伤害奇效"}
CommonText[10020] = {"每级增加已方25点穿刺", "每级增加已方25%暴击", "每级增加已方25%伤害"}
CommonText[10021] = "冷却倒计时"
CommonText[10022] = "确定花费%d%s清除冷却时间吗？"
CommonText[10023] = {"设置自动战斗成功", "取消自动战斗成功"}
CommonText[10024] = "确定取消自动战斗吗?"
CommonText[10025] = "清除冷却时间成功"
CommonText[10026] = "活动暂未开放"
CommonText[10027] = "每周五(20:50-21:30)"
CommonText[10028] = "祝福成功"
CommonText[10029] = "是否花费%d%s祝福？"
CommonText[10030] = "是否花费%d%s清除CD时间"
CommonText[10031] = "成功清除CD时间"
CommonText[10032] = "提升资历已最高，无法提升"
CommonText[10033] = {"自动升级建筑", "建筑位有空闲时，自动升级建筑持续4小时"}
CommonText[10034] = "自动升级"
CommonText[10035] = "请先购买自动升级时间，再开启自动功能"
CommonText[10036] = "剩余"
CommonText[10037] = "是否花费%d%s自动升级建筑"
CommonText[10038] = "自动升级建筑成功!"
CommonText[10039] = "等级达到%d级开启聊天,VIP无限制"
CommonText[10040] = {"个人信息", "编制玩法","军衔信息","参谋配置"}
CommonText[10041] = {"编制等级", "编制经验", "全服排名", "编制职位"}
CommonText[10042] = {"达成要求", "属性奖励"}
CommonText[10043] = {"资历要求", "编制要求", "人数限制", "无限制", "编制经验高优先"}
CommonText[10044] = {"世界等级", "效果影响", "下级影响"}
CommonText[10045] = "参谋部"
CommonText[10046] = "矿区尽头"
CommonText[10047] = {"非活动期间", "掠夺", "占领"}
CommonText[10048] = "数量不足, 无法合成"
CommonText[10050] = "是否消耗%d个%s合成一个%s"
CommonText[10051] = "矿点信息"
CommonText[10052] = {"最高为10级", "世界地图损兵比例降低为%s"}
CommonText[10053] = "已获得编制经验"
CommonText[10054] = {"达到%s编制职位才能进入军事演习", "世界等级达到1级才能进入军事演习"}
CommonText[10055] = "每周一12:00开始演习报名"
CommonText[10056] = {"非活动期间，无法侦查", "非活动期间，无法掠夺", "非活动期间，无法占领"}
CommonText[10057] = "每周六-每周日全天开放"
CommonText[10058] = {"开服31天后开启参谋部", "开服31天后开启军事矿区"}
CommonText[10059] = {"军事矿区", "军事演习"}
CommonText[10060] = "个人排名"
CommonText[10061] = {"积分大于150才可上榜", "积分大于800才可上榜"}
CommonText[10062] = {"个人奖励", "军团奖励", "全服奖励"}
CommonText[10063] = {"掠夺次数已用完，无法掠夺", "该资源点无玩家开采，请点击占领", "该资源点正受到保护", "该资源已被占领，请点击掠夺", "你已占领该资源"}
CommonText[10064] = {"是否花费%d金币购买一次掠夺", "购买成功"}
CommonText[10065] = "该资源已被占领，是否点击掠夺?"
CommonText[10066] = "是否消耗%d个万能碎片合成配件？"
CommonText[10067] = {"活动状态：", "BOSS等级：", "我的伤害：", "我的排名：", "挑战倒计时："}
CommonText[10068] = "每日单笔充值任意金额"
CommonText[10069] = "可获20%金币返还（充值后系统邮件中领取）"
CommonText[10070] = "已转次数:"
CommonText[10071] = "已获得所有奖励"

CommonText[20000] = "未开放"
CommonText[20001] = "升级后自动激活"
CommonText[20002] = "未学习"
CommonText[20003] = "解锁成功！"
CommonText[20004] = "军工科技升级成功！"
CommonText[20005] = "要塞战"
CommonText[20007] = "能量充沛，暂时无需使用"
CommonText[20008] = "能量上限为%d点，只能领取%d点能量，超出部分无法累计能量，其他奖励将不受影响。现在领取吗？"
CommonText[20009] = "稍等"
CommonText[20010] = "胜利军团："
CommonText[20011] = "和平时期(点击据点，可查看战时战报)"
CommonText[20012] = "您未有参战资格"
CommonText[20013] = "预热倒计时:"
CommonText[20014] = "结束倒计时:"
CommonText[20015] = "战斗中"
CommonText[20016] = "攻"
CommonText[20017] = "守"
CommonText[20018] = "(耐久度:%d/%d)"
CommonText[20019] = "查看战报"
CommonText[20020] = "设置防守部队"
CommonText[20021] = "进修"
CommonText[20022] = "进修增益仅在军团争霸中生效!"
CommonText[20023] = "预热中"
CommonText[20024] = "战斗记录"
CommonText[20025] = {"个人战报","全服战报"}
CommonText[20026] = {"胜","败", "无效"}
CommonText[20027] = "丰碑"
CommonText[20028] = "积分排行"
CommonText[20029] = "战绩排行"
CommonText[20030] = {"总积分","大于50分","可获得军团排名奖励"}
CommonText[20031] = "战斗次数"
CommonText[20032] = "本军团排名:"
CommonText[20033] = "积分将折算成军团贡献排行"
CommonText[20034] = "击毁坦克"
CommonText[20035] = "胜利次数"
CommonText[20036] = "要塞战胜利军团享有至高权利！"
CommonText[20037] = {"职位","飞艇"}
CommonText[20038] = "任命玩家"
CommonText[20039] = "输入玩家名字"
CommonText[20040] = "目前任命:"
CommonText[20041] = "要塞战驻军"
CommonText[20042] = "驻守要塞"
CommonText[20043] = "请选择攻击要塞驻军"
CommonText[20044] = "确定花费%d金币进修到%s？"
CommonText[20045] = "下级属性:\n"
CommonText[20046] = "积分第%d军团奖励"
CommonText[20047] = "胜利军团获得buff"
CommonText[20048] = "奖励发放到军团福利院由军团长分配"
CommonText[20049] = "预热时间:周日19:30-20:00\n争夺时间:周日20:00-20:15"
CommonText[20050] = "任命"
CommonText[20051] = "要塞战已结束！"
CommonText[20052] = "暂无"
CommonText[20053] = "持续:%dh"
CommonText[20054] = "本周百团混战积分:"
CommonText[20055] = "本周百团混战排名:"
CommonText[20056] = "军团百团混战前10名才可参战"
CommonText[20057] = "无进修资格！"
CommonText[20058] = {" 资源增益效果："," 全面开采效果："," 资源丰收效果："," 军团战资源增产："," 要塞战官职效果：", " 活动增益：","老玩家回归加成："}
CommonText[20059] = "任命成功！"
CommonText[20060] = "要塞争夺战已经打响！"
CommonText[20061] = "显示行军路线"
CommonText[20062] = "开服45天后开启要塞战！"
CommonText[20063] = "已过期"
CommonText[20064] = "每周二 00:00:00开始军事演习报名"
CommonText[20065] = "演习场地"
CommonText[20066] = {"蓝军","红军"}
CommonText[20067] = {"战车工厂","军事学院","装备工厂"}
CommonText[20068] = "当前状态:"
CommonText[20069] = "报名玩家:"
CommonText[20070] = "我的阵营:"
CommonText[20071] = "我的部队:"
CommonText[20072] = "阵营功勋:"
CommonText[20073] = {"报名","已报名"}
CommonText[20074] = "演习军力"
CommonText[20075] = "商店"
CommonText[20076] = "兑换坦克"
CommonText[20077] = "参战坦克由基地坦克兑换"
CommonText[20078] = "(兑换后无法换回基地坦克)"
CommonText[20079] = "兑换数量："
CommonText[20080] = "获得数量："
CommonText[20081] = "据点"
CommonText[20082] = {"红军部队：","蓝军部队：","占领阵营："}
CommonText[20083] = "阵营"
CommonText[20084] = "战绩(胜/负)"
CommonText[20085] = {"胜利阵营:","我的数据:"}
CommonText[20086] = "演习进修"
CommonText[20087] = "同阵营所有部队享受进修效果！"
CommonText[20088] = "个人进修:"
CommonText[20089] = "阵营奖励"
CommonText[20090] = "暂无奖励"
CommonText[20091] = {"胜利阵营奖励","失败阵营奖励"}
CommonText[20092] = "演习商店"
CommonText[20093] = "我的功勋:"
CommonText[20094] = "刷新倒计时:"
CommonText[20095] = "功勋:"
CommonText[20096] = "备战"
CommonText[20097] = "全服限购"
CommonText[20098] = "确定撤销此路防守？"
CommonText[20099] = "撤销防守成功"
CommonText[20100] = "最多只能设置2路防守！"
CommonText[20101] = "此路没有布防！"
CommonText[20102] = "周二00:00-20:30才能报名！"
CommonText[20103] = "当前状态未开启或未报名!"
CommonText[20104] = "报名后才能设置防守部队！"
CommonText[20105] = "备战期才能设置防守部队！"
CommonText[20106] = "备战期才能进修！"
CommonText[20107] = "进修成功！"
CommonText[20108] = "帮助"
CommonText[20109] = "帮助手册"
CommonText[20110] = "兑换后无法换回基地坦克！确定兑换？"
CommonText[20111] = "获得功勋:"
CommonText[20112] = "前往兑换"
CommonText[20113] = "每次军事演习可设置2只部队！"
CommonText[20114] = "叛军来袭"
CommonText[20115] = "每日的12:00和18:00开启；\n持续时间为60分钟"
CommonText[20116] = "已刷新"
CommonText[20117] = "本轮击杀："
CommonText[20118] = "追杀时间："
CommonText[20119] = "叛军剩余："
CommonText[20120] = {"分队","卫队","头目"}
CommonText[20121] = {"已击杀","未击杀","已逃跑"}
CommonText[20122] = "前往平叛"
CommonText[20123] = "我的击杀数："
CommonText[20124] = "击杀数"
CommonText[20125] = "积分大于%d分才能上榜"
CommonText[20126] = "上周排名："
CommonText[20127] = {"叛军已被击杀！","匪徒已被击杀！"}
CommonText[20128] = "开服%d天后开启！"
CommonText[20129] = "全开模式"
CommonText[20130] = "%d号灯位奖励"
CommonText[20131] = {"叛军","本周排行","总排行"}
CommonText[20132] = "邮件最多储存30天，超过保存时间的邮件将消失，请指挥官注意！"
CommonText[20133] = "确定需要花费%d%s购买使用吗？"
CommonText[20134] = "挂件使用成功！"
CommonText[20135] = "可用"
CommonText[20136] = "开启此功能需要等级达到%d"
CommonText[20137] = "普通挂件"
CommonText[20138] = "(已达该等级上限)"
CommonText[20139] = "前往"
CommonText[20140] = "收集"
CommonText[20141] = "春意怏然，攻打关卡，资源点和玩家基地可获得相应道具，集齐可拼合“春暖花开”，单个道具也可兑换丰厚奖励"
CommonText[20142] = "注：拼合后获得的道具可以兑换特殊奖励"
CommonText[20143] = "拼合"
CommonText[20144] = "挂件"
CommonText[20145] = {"头像预览","挂件预览"}
CommonText[20146] = "探索预览"
CommonText[20147] = "免费探索只用于普通探索"
CommonText[20148] = {"世界争霸","军团争霸","军事演习","王者之城"}
CommonText[20149] = "鲜花数量："
CommonText[20150] = "指挥官到达%d级开启该能晶格"
CommonText[20151] = "一键镶嵌"
CommonText[20152] = "暂无能晶无法镶嵌"
CommonText[20153] = "(进阶后保留装备经验)"
CommonText[20154] = "进阶成功!"
CommonText[20155] = {
	"进阶后，原装备的经验值完全保留，根据橙色装备的经验条重新计算等级与属性",
	"  1.橙色套装有2件套属性，4件套属性，以及6件套属性",
	"  2.橙色装备也可替代蓝色和紫色装备完成对应的套装激活",
}
CommonText[20156] = "套装说明"
CommonText[20157] = {"宝藏","黑市","海贼宝藏"}
CommonText[20158] = "转动转盘，你来决定充多少送多少！"
CommonText[20159] = {"累计充值满","金币，可获得","返利"}
CommonText[20160] = {"恭喜获得返利%s的福利","本次获得充值%s返利%s福利","是否放弃当前充值返利比例，同时让当前已充值的进度清零？"}
CommonText[20161] = "剩余次数不足！"
CommonText[20162] = {"单次开启","全部开启","是否花费%d金币开启？"}

CommonText[20163] = {"勋章","查看勋章","万能"}
CommonText[20164] = {"佩戴部位：","升级等级：","打磨等级："} 
CommonText[20165] = {"升级","打磨","精炼"}
CommonText[20166] = {"升级冷却","升级消耗","打磨消耗","此品质无法打磨","打磨达到最大等级","升级达到最大等级"}
CommonText[20167] = "升级时，有几率触发幸运暴击和幸运升级！"
CommonText[20168] = "升级已到冷却时间，是否清除冷却CD？"
CommonText[20169] = "点击可按勋章品质进行批量分解"
CommonText[20170] = "请选择要分解的勋章品质"
CommonText[20171] = "请选择要分解的勋章碎片品质"
CommonText[20172] = "%d个可合成 %s"
CommonText[20173] = "可替换任意一种勋章碎片进行合成"
CommonText[20174] = "是否消耗%d个勋章之心合成勋章？"
CommonText[20175] = {"分享","勋章%s成功"}
CommonText[20176] = "指挥官到达%d级开启该勋章位"
CommonText[20177] = "我的"
CommonText[20178] = "确定重置奖励和开启次数吗？"
CommonText[20179] = {"勋章展厅","展示属性","收集属性"}
CommonText[20180] = {"紫蓝","绿白"}
CommonText[20181] = {"共计","枚","展示","已展示"}
CommonText[20182] = "(展示需要永久消耗一枚勋章)"
CommonText[20183] = "(展示%d枚勋章激活)"
CommonText[20184] = "展示成功！"
CommonText[20185] = "展示需要消耗此枚勋章，确定继续展示？"
CommonText[20186] = {"获得利是:","我的召唤:","召唤波次:","剩余利是","利是获得数量","召唤次数","逃跑计时:"}
CommonText[20187] = {"勤劳排行","召唤排行"}
CommonText[20188] = {[-1] = "不可召唤",[0] = "可召唤", [1] = "已召唤"}
CommonText[20189] = "打赏"
CommonText[20190] = "您的活动道具不足，是否花费%d金币购买一个%s？"
CommonText[20191] = "花费%d金币召唤Boss？"
CommonText[20192] = "召唤成功！"
CommonText[20193] = "(%d%s以上才能入榜)"
CommonText[20194] = "请选择物品"
CommonText[20195] = "每充值满%d金币可领取(可重复领)"
CommonText[20196] = "花费金币购买100水晶并获赠一次装备补给机会"
CommonText[20197] = "每轮淘汰赛可选择精英组，巅峰组选手各一名进行下注。"
CommonText[20198] = {"拜女神","许愿"}
CommonText[20199] = "VIP5或以上的玩家才能获得拜女神的金币返还"
CommonText[20200] = "使用%d金币拜女神，获得%d%%-%d%%金币返还"
CommonText[20201] = "剩余拜女神次数:"
CommonText[20202] = {"一拜女神","二拜女神","三拜女神","四拜女神","五拜女神"}
CommonText[20203] = "金币记录"
CommonText[20204] = "您花费了%d金币拜女神，获得%d%%金币返还，女神赐予您%d金币"
CommonText[20205] = "每完成1个任务获得1次许愿机会"
CommonText[20206] = "剩余许愿次数:"
CommonText[20207] = "许愿池:许愿时概率获得"
CommonText[20208] = "许愿"
CommonText[20209] = "许愿次数+1"
CommonText[20210] = "进度:"
CommonText[20211] = {"前往","已完成"}
CommonText[20212] = "是否使用%d金币拜女神,获得金币返还?"
CommonText[20213] = {"    从今天开始的七天内 ，您每天登陆都可以秒升一级哦!","    您今天已经使用过立即升级功能啦，明天再来看看吧！","待会再来"}
CommonText[20214] = "规模"
CommonText[20215] = {"当前vip等级：","每天每种道具可享受一定次数的优惠价格","vip等级越高优惠次数越多\n优惠次数每日0点重置，届时请重新打开商城购买"}
CommonText[20216] = {"VIP商城","世界商城","售罄"}
CommonText[20217] = "vip%d可领取"
CommonText[20218] = {"当前世界等级：","每天每种道具可享受一定次数的折扣优惠","世界等级越高折扣力度越大，优惠次数越多\n优惠次数每日0点重置，届时请重新打开商城购买"}
CommonText[20219] = "尊敬的 VIP%d 玩家,您的成长基金%d 级可领取%d 金币，提升到VIP%d 即可额外总计最多获取 %d 金币"
CommonText[20220] = "升级vip"
CommonText[20221] = "世界商城将在编制系统开放后开启"
CommonText[20222] = "原价:"
CommonText[20223] = "活动剩余时间:"
CommonText[20224] = {"累计学分:","去觉醒","后免费补充一本"}
CommonText[20225] = {"进修一次","进修十次"}
CommonText[20226] = "进修道具不足，是否使用%d金币购买%d本进修教材并使用？"
CommonText[20227] = "一键升级时，消耗同等材料快速提升勋章经验！"
CommonText[20228] = "每月5号和20号00:00开启；\n持续2天"

CommonText[30000] = "服务器列表"
CommonText[30001] = "不满足条件！"
CommonText[30002] = "选择报名组别"
CommonText[30003] = {"世界争霸，最强王者由此决出！","无法想象的丰厚奖励等你来拿！"}
CommonText[30004] = "争霸时间："
CommonText[30005] = {"参赛服：","参赛资格：","当前阶段：","阶段倒计时："}
CommonText[30006] = "竞技场达到前100名(上期排名)均可报名"
CommonText[30007] = "战力要求："
CommonText[30008] = "下注信息"
CommonText[30009] = "积分商店"
CommonText[30010] = {"精英场入口","巅峰场入口"}
CommonText[30011] = "世界争霸"
CommonText[30012] = {"精英组","巅峰组"}
CommonText[30013] = {"报名成功","取消报名成功"}
CommonText[30015] = {"精英档案","巅峰档案"}
CommonText[30016] = "开战时间："
CommonText[30017] = "参赛人数："
CommonText[30018] = {"玩家：","军团：","服务器："}
CommonText[30019] = {"竞技场排行前100名(上期排名)可报名","竞技场排行前20(上期排名)且战力大于35M可报名"}
CommonText[30020] = {
	"报名资格争夺（竞技场前100名可报名）",
	"报名期（满足资格和战力要求的玩家可以报名）",
	"积分赛第一轮准备期（参赛者可改变战术和阵型）",
	"积分赛第一轮预热期（禁止布阵）",
	"积分赛第一轮进行中",
	"积分赛第二轮准备期（参赛者可改变战术和阵型）",
	"积分赛第二轮预热期（禁止布阵）",
	"积分赛第二轮进行中",
	"积分赛第三轮准备期（参赛者可改变战术和阵型）",
	"积分赛第三轮预热期（禁止布阵）",
	"积分赛第三轮进行中",
	"淘汰赛第一轮准备期（参赛者可改变战术和阵型）",
	"淘汰赛第一轮进行中",
	"淘汰赛第二轮准备期（参赛者可改变战术和阵型）",
	"淘汰赛第二轮进行中",
	"淘汰赛第三轮准备期（参赛者可改变战术和阵型）",
	"淘汰赛第三轮进行中",
	"淘汰赛第四轮准备期（参赛者可改变战术和阵型）",
	"淘汰赛第四轮进行中",
	"半决赛准备期（参赛者可改变战术和阵型）",
	"半决赛进行中",
	"决赛准备期（参赛者可改变战术和阵型）",
	"决赛进行中",
	"积分商店开放中",
}
CommonText[30021] = "未开始"
CommonText[30022] = {"积分赛","淘汰赛","总决赛","排行"}
CommonText[30023] = {"16进8","8进4","赛区半决赛","赛区总决赛"}
CommonText[30024] = {"半决赛","决赛", "季军赛"}
CommonText[30025] = {"参与世界争霸和下注可获得大量积分","只有参赛选手才能兑换珍品","积分将在跨服战结束后清零"}
CommonText[30026] = "跨服商店"
CommonText[30027] = {[2]="进攻方未设置阵型",[3]="防守方未设置阵型",[4]="防守方不存在",[5]="双方未设置阵型",[6]="进攻方不存在"}
CommonText[30028] = "赛区"
CommonText[30029] = "积分详情"
CommonText[30030] = "赛区冠军"
CommonText[30031] = "我要下注"
CommonText[30032] = "当前阶段准备期才可下注！"
CommonText[30033] = "下注"
CommonText[30034] = "下注成功!"
CommonText[30035] = "已下注："
CommonText[30036] = "被下注总额"
CommonText[30037] = "确定使用%d金币下注？"
CommonText[30038] = "距离截止时间："
CommonText[30039] = "下注目标："
CommonText[30040] = "获得积分："
CommonText[30041] = "未结束"
CommonText[30042] = "第%d场"
CommonText[30043] = {"冠军","亚军","季军","殿军","人气王"}
CommonText[30044] = "世界争霸结束时参赛选手可领取排名奖励"
CommonText[30045] = "对战信息不完整，无法下注"
CommonText[30046] = "特殊挂件"
CommonText[30047] = "特殊头像"
CommonText[30048] = "获得%s积分"
CommonText[30049] = "跨服战已结束"
CommonText[30050] = {"商店兑换开启：","商店兑换结束："}
CommonText[30051] = "跨服排行"
CommonText[30052] = {"跨服名人","跨服军团榜"}
CommonText[30053] = "战局回顾"
CommonText[30054] = "跨服战"
CommonText[30055] = "第%d届"
CommonText[30056] = "红色框为巅峰组，蓝色框为精英组"

CommonText[30057] = "百团大战本服排名前3的军团可报名"
CommonText[30058] = "全服军团"
CommonText[30059] = "%s组战况"
CommonText[30060] = "全服概况"
CommonText[30061] = {"小组战况","本服战况","决赛战况","排行"}
CommonText[30062] = "个人排行"
CommonText[30063] = "军团争霸，最强军团在此产生！"
CommonText[30064] = "军团争霸入口"
CommonText[30065] = {
	"参赛资格争夺",
	"报名时间",
	"小组赛布阵",
	"小组赛A组进行",
	"小组赛B组进行",
	"小组赛C组进行",
	"小组赛D组进行",
	"决赛布阵",
	"决赛开启",
	"领奖以及商品兑换",
}
CommonText[30066] = {"报名团员","本军团已报名玩家："}
CommonText[30067] = "决赛军团"
CommonText[30068] = {"本军团积分：","本军团排名："}
CommonText[30069] = {"本组已报名军团数：","本军团小组赛组别：","已报名总军团数："}
CommonText[30070] = "%s组"

CommonText[500] = "需要科技馆%s级开放"
CommonText[501] = "%s升级到%s级"
CommonText[502] = "取消升级会扣除部分资源和道具，是否确定？"
CommonText[503] = "等待中..."
CommonText[504] = "全部"
CommonText[505] = {"将领图鉴","将领招募","将领分解","将领进阶"}
CommonText[506] = "将领图鉴"
CommonText[507] = {"拥有:","派出:"}
CommonText[508] = "带兵:"
CommonText[509] = "无"
CommonText[510] = {"坦克生产速度","坦克改装速度","科技研发速度"}
CommonText[511] = {"关卡经验","资源点经验"}
CommonText[512] = "将领属性"
CommonText[513] = {"将领加成","将领技能:"}
CommonText[514] = {"将领升级","将领分解","将领上阵","将领分享","将领觉醒","完成任务","觉醒任务"}
CommonText[515] = {"取消","分解"}
CommonText[516] = "分解后获得以下材料"
CommonText[517] = "分解成功!"
CommonText[518] = {"取消","开始升级"}
CommonText[519] = "升级所需材料"
CommonText[520] = {"金币招募","资源招募"}
CommonText[521] = "将领招募"
CommonText[522] = {"招募1次","招募5次"}
CommonText[523] = "招募说明"
CommonText[524] = "1.可花费%s进行招募，或者花费金币购买100水晶并获赠一次金币招募机会"
CommonText[525] = "2.招募消耗随次数递增，每日0点重置"
CommonText[526] = "3.最高可招募三星将领"
CommonText[527] = "(金币招募概率更高)"
CommonText[528] = "资源不足"
CommonText[529] = "请选择要分解的将领品质"
CommonText[530] = "将领进阶"
CommonText[531] = {"进阶后随机获得一个","将领","剩余进阶石:"}
CommonText[532] = {"自动选择","一键进阶","进阶"}
CommonText[533] = "暂无可分解的将领"
CommonText[534] = "选择升阶将领"
CommonText[535] = {"请选择6个升阶将领","是否花费%s金币购买进%d个阶石进阶？","是否花费%s个进阶石进阶将领？"}
CommonText[536] = "进阶获得"
CommonText[537] = {"好友列表","好友祝福","收藏列表"}
CommonText[538] = {"祝福","领取","加好友","已祝福","一键祝福","删好友","写信","私聊","一键领取"}
CommonText[539] = "好友数量:"
CommonText[540] = "请输入要搜索玩家的昵称"
CommonText[541] = "暂无该玩家信息"
CommonText[542] = "暂无可祝福的好友"
CommonText[543] = "查看玩家信息"
CommonText[544] = {"等级:","战力:","军团:","坐标:"}
CommonText[545] = "将领升级成功"
CommonText[546] = "备注:"
CommonText[547] = "邮箱"
CommonText[548] = {"邮件","发件","报告","系统"}
CommonText[549] = {"删除","联系","回信","写信"}
CommonText[550] = {"收件人:","发件人:","主  题:"}
CommonText[551] = {"发送成功","删除成功"}
CommonText[552] = {"总共:","未读:","好友"}
CommonText[553] = {"取消","发送"}
CommonText[554] = {"标题不能为空","收件人不能为空","内容不能为空","收件人不符合格式规范","邮件列表为空","是否清空所有邮件?","是否清空所有战报?"}
CommonText[555] = {"装备补给"}
CommonText[556] = {"查看装备","买1次","买9次","免费获取"}
CommonText[557] = {"剩余金币:","免费次数:","%s后免费"}
CommonText[558] = "可能获得装备"
CommonText[559] = {"普通","高级","探宝","前线阵地"}
CommonText[560] = {"每次探宝消耗：","个幸运币或","个","金币购买100水晶","并获赠普通宝箱一个","并获赠高级宝箱一个"}
CommonText[561] = {"可获得：","高阶坦克、统率书、技能书、","资源buff、增益buff等高级道具"}
CommonText[562] = {"拥有","幸运币:","挑选宝箱","免费探宝次数：1","幸运币可从活跃任务中获得"}
CommonText[563] = "炮弹不足，是否花费%s金币购买%s发炮弹继续进攻?"
CommonText[564] = "获得%s"
CommonText[565] = {"军团","军团大厅"}
CommonText[566] = {"军团列表","创建军团"}
CommonText[567] = {"军团名：","等级：","人数","战斗力："}
CommonText[568] = {"点击军团列表，可查看军团信息","可加入","输入要查询的军团"}
CommonText[569] = {"军团名称：","军团名长度限制为2-6位","加入条件：","创建方式：","等级达到%s级后可创建军团","创建"}
CommonText[570] = {"申请即可加入","申请后需审批通过"}
CommonText[571] = {"军团名：","军团长：","排   名：","等   级：","人   数：","加入方式：","加入条件：","军团宣言"}
CommonText[572] = {"等级不足!","资源不足!","军团名称不能为空","军团名包含敏感词汇","创建军团成功"}
CommonText[573] = "请输入要搜索军团的名称"
CommonText[574] = {"申请","取消申请"}
CommonText[575] = {"无","等级：%s","战斗力：%s"} 
CommonText[576] = "军团宣言"
CommonText[577] = "显示后20个"
CommonText[578] = {"军团名：","军团等级：","升级需求：","总建设度："}
CommonText[579] = {"提升等级"}
CommonText[580] = {"类别","需求","当前拥有","建设度","贡献","操作"}
CommonText[581] = {"军团大厅","科技大厅","福利院","军情处","军团商店","作战中心","军团祭坛"}
CommonText[582] = {"提升等级"}
CommonText[583] = "捐献"
CommonText[584] = {"捐献成功,贡献+%s,军团建设度+%s","捐献成功,贡献+%s"}
CommonText[585] = "升级成功"
CommonText[586] = {"物品","珍品"}
CommonText[587] = "我的贡献："
CommonText[588] = "贡献："
CommonText[589] = "兑换"
CommonText[590] = "兑换成功"
CommonText[591] = "军团商店"
CommonText[592] = "军团等级%s级开放"
CommonText[593] = {"普通兑换：","普通兑换次数0点重置","每天可兑换次数为括号内次数","珍品兑换：","每天0点、12点、18点刷新物品","每次刷新后军团玩家只可兑换一次","军团所有玩家兑换次数为括号内次数"}
CommonText[594] = {"科技大厅等级：","升级需求：","总建设度：","个人贡献："}
CommonText[595] = {"科技大厅","科技捐献"}
CommonText[596] = {"(未解锁)","科技大厅LV.%s级解锁"}
CommonText[597] = {"类别","需求","当前拥有","贡献","操作"}
CommonText[598] = {"捐献成功,贡献+%s,科技%s经验+%s","捐献成功,贡献+%s"}
CommonText[599] = {"科技大厅%s级","升级经验%s"}
CommonText[600] = "已满级"
CommonText[601] = {"日常福利","战事福利","军团活跃","职位任命"}
CommonText[602] = {"福利院等级：","升级需求：","总建设度：","个人贡献："}
CommonText[603] = {"当前福利","消耗贡献：","福利一览","领取福利"}
CommonText[604] = "福利院"
CommonText[605] = "领取成功"
CommonText[606] = {"军团活跃：","LV.%s 福利","今日可领取：","今日已领取："}
CommonText[607] = {"活跃榜","前往采集","领取"}
CommonText[608] = {"无福利","可领取当天全体军团成员采集资源的%s","当日每个成员第一次捐献科技，可获得%s倍科技经验"}
CommonText[609] = "福利一览"
CommonText[610] = {"活跃度  +","今日上限："}
CommonText[611] = "需要福利院LV.%s级（消耗个人贡献%s点）"
CommonText[612] = "加入军团成功"
CommonText[613] = "申请加入军团成功，请等待审批"
CommonText[614] = "暂无军团信息"
CommonText[615] = "(已申请)"
CommonText[616] = "取消申请成功"
CommonText[617] = "军情处"
CommonText[618] = {"民情","军情"}
CommonText[619] = {"时间","事件","操作"}
CommonText[620] = {"军团信息","军团成员","贡献排名","军团列表"}
CommonText[621] = "内部公告"
CommonText[622] = {"军团情报","保存","职位编辑","军团设置","军团招募","军团聊天","军团邮件","审批","军团驻地","退出军团"}
CommonText[623] = "是否确认退出军团?"
CommonText[624] = "退出军团成功"
CommonText[625] = {"设置自定义职位"}
CommonText[626]	= {"职位1：","职位2：","职位3：","职位4："}
CommonText[627] = {"说明：","自定义职位根据军团等级自动开放","每个职位最多任职3名成员","自定义名称不能超过4个字"}
CommonText[628] = "军团等级%s级开放"
CommonText[629] = "设定职位成功"
CommonText[630] = "职位不能超过4个字"
CommonText[631] = {"设置加入方式","设置加入条件"}
CommonText[632] = {"等级","战斗力"}
CommonText[633] = "更改军团信息成功"
CommonText[634] = "军团全部成员"
CommonText[635] = "申请人数："
CommonText[636] = "清空列表"
CommonText[637] = {"忽略","同意"}
CommonText[638] = "职务"
CommonText[639] = {"军团长","副团长","成员"}
CommonText[640] = {"捐献周贡献:","周贡献:"}
CommonText[641] = "是否清空申请列表?"
CommonText[642] = {"玩家名：","职位：","排名：","等级：","战力：","个人贡献：","在线情况："}
CommonText[643] = {"联系：","军团操作："}
CommonText[644] = {"在线","离线时间%s"}
CommonText[645] = "成员查看"
CommonText[646] = {"邮件","私聊"}
CommonText[647] = {"升职","设定职位","踢出军团","转让团长","退出军团"}
CommonText[648] = "升职成功，恭喜成为%s"
CommonText[649] = "操作成功"
CommonText[650] = "是否将成员%s踢出军团?"
CommonText[651] = "是否将团长转让给%s?"
CommonText[652] = "设定职位"
CommonText[653] = {"系统职位","自定义职位"}
CommonText[654] = {"试练场","军团战场"}
CommonText[655] = {"未击杀据点：","可领奖："}
CommonText[656] = {"今天攻击次数：","每天0点重置试练次数"}
CommonText[657] = "军团贡献不足"
CommonText[658] = {"战斗信息","城市繁荣","资源信息","部队损失","战利品"}
CommonText[659] = {{"进攻目标：","部队遭到："},"战斗地点：","战斗时间：","战斗结果：",{"获得荣誉：","损失荣誉："},"据点驻军："}
CommonText[660] = {"进攻胜利","进攻失败","防守胜利","防守失败"}
CommonText[661] = {"攻方：","守方：","将领：","编制经验："}
CommonText[662] = "资源掠夺:"
CommonText[663] = "(先手)"
CommonText[664] = "零损兵获胜"
CommonText[665] = "无防守阵形"
CommonText[666] = {"挑战奖励","击杀奖励"}
CommonText[667] = {"大量经验","技能书","声望"}
CommonText[668] = "军团建设度"
CommonText[669] = "挑战不会损耗部队"
CommonText[670] = "开服礼包"
CommonText[671] = "登录第%s天"
CommonText[672] = {"领取","已领取", "不可领取"}
CommonText[673] = {"分享到:","军团频道","世界频道"}
CommonText[674] = {"主线任务","日常任务","日常活跃"}
CommonText[675] = {"基地建设","角色任务","资源产量"}
CommonText[676] = {"进度：","前往","领取奖励","已完成","接受","快速完成","领取奖励"}
CommonText[677] = {"放弃","刷新","日常任务(%s/%s)","有几率刷出5星任务","重置"}
CommonText[678] = "是否花费5金币立即完成任务?"
CommonText[679] = "金币不足"
CommonText[680] = "今日已无次数，请等待刷新或使用金币重置"
CommonText[681] = "是否花费%s金币刷新每日任务?"
CommonText[682] = "是否花费%s金币重置每日任务?"
CommonText[683] = "任务"
CommonText[684] = "未接受"
CommonText[685] = "活跃:"
CommonText[686] = {"活跃度","达到可领取活跃奖励"}
CommonText[687] = {"未达成","领取"}
CommonText[688] = "活跃点达到%s点"
CommonText[689] = "附件"
CommonText[690] = "提取附件"
CommonText[691] = "野外基地玩家等级3级开启"
CommonText[692] = "提取附件"
CommonText[693] = "挑战次数不足"
CommonText[694] = {"新手礼包","领取"}
CommonText[695] = "是否删除当前收藏?"
CommonText[696] = "活跃排行"
CommonText[697] = "个人活跃每日0点重置"
CommonText[698] = "为了军团的荣耀而战"
CommonText[699] = "您已被踢出军团"
CommonText[700] = {
					"军团活跃",
					"活跃等级",
					"军团活跃等级从1级开始",
					"每天0点，将会根据军团活跃等级扣除相应的活跃度:",
					"1.1级扣除50点军团活跃度",
					"2.2级扣除200点军团活跃度",
					"3.3级扣除300点军团活跃度",
					"4.4级扣除400点军团活跃度",
					"5.5级扣除600点军团活跃度",
					"加入军团满24小时后，才可享受资源福利",
					"军团活跃不足当前等级值时，将会掉级！请保持活跃等级，获得最大福利！",
					"活跃福利说明",
					"1级福利：无",
					"2级福利：可领取当天全体军团成员采集资源的0.2%",
					"3级福利：可领取当天全体军团成员采集资源的0.4%;当日每个成员第1次捐献科技，可获得3倍科技经验",
					"4级福利：可领取当天全体军团成员采集资源的0.6%;当日每个成员第1次捐献科技，可获得4倍科技经验",
					"5级福利：可领取当天全体军团成员采集资源的1.0%;当日每个成员第1次捐献科技，可获得5倍科技经验"
}
CommonText[701] = "是否跳过新手引导?"
CommonText[702] = "跳过引导"
CommonText[703] = "暂无可用来进阶的将领"
CommonText[704] = "是否花费%s金币购买水晶并获赠装备补给机会"
CommonText[705] = "好友能量:"
CommonText[706] = {
	{"我们的部队挑战了%s","我们的部队遭到%s的挑战","%s VS %s"},
	"战斗时间:",
	"战斗结果:"
}

CommonText[707] = "再买%s次必出紫装"
CommonText[708] = "添加好友成功"
CommonText[709] = "删除好友成功"
CommonText[710] = "好友数量已达上限"
CommonText[711] = "装备仓库剩余容量不足！"
CommonText[712] = "GM工具"
CommonText[713] = "当前有一次免费探宝机会，是否继续?"
CommonText[714] = "高级战场"
CommonText[715] = "招募信息已发送至聊天频道"
CommonText[716] = "百团混战"
CommonText[717] = "百团混战暂未开放"
CommonText[718] = "公告内容包含敏感字符"
CommonText[719] = "公告内容长度不能超过%s"
CommonText[720] = "是否花费%s金币进行贡献?"
CommonText[721] = "是否花费%s金币购买水晶并获赠招募机会?"
CommonText[722] = {
		"1.可获得坦克碎片，坦克碎片可以组装成专属坦克(点击坦克可以查看坦克属性)",
		"2.每天一次免费抽取次数。活动结束后，坦克碎片清零(请及时组装)",
		"3.抽取过程中有几率出现下一次抽取翻倍或翻两倍，多抽多得哦！"
	}
CommonText[723] = "抽%s次"
CommonText[724] = {"活动","限时活动","跨服活动"}
CommonText[725] = "限时活动"
CommonText[726] = "无法选择已出战的武将"
CommonText[727] = {"活动时间","活动说明"}
CommonText[728] = "组装"
CommonText[729] = "免费"
CommonText[730] = "是否花费%s金币进行抽取?"
CommonText[731] = "充值"
CommonText[732] = {"聊天","邮件"}
CommonText[733] = {"禁言","解禁","踢人","设置vip","设置累充","清除邮件"}
CommonText[734] = "玩家昵称："
CommonText[735] = {"玩家昵称不能为空","玩家VIP不能为空","玩家累计充值金额不能为空"}
CommonText[736] = {"首充获赠","双倍金币","还送价值","3999的超值礼包"}
CommonText[737] = {"首充礼包","充值就送"}
CommonText[738] = "元"
CommonText[739] = "充值功能暂未开放!"
CommonText[740] = "点击编辑内部公告"
CommonText[741] = {"活动奖励:35","补偿奖励:36","物资奖励:37"}
CommonText[742] = "请填写活动名称"
CommonText[743] = "奖励ID不存在"
CommonText[744] = "请填写奖励ID"
CommonText[745] = "请填写moldId"
CommonText[746] = "moldId必须为35，36，37，41, 43"
CommonText[747] = "已领取"
CommonText[748] = "首次必得紫装"
CommonText[749] = "是否消耗%s点贡献度领取奖励?"
CommonText[750] = {"邮件标题长度不能超过20字","邮件内容长度不能超过200字"}
CommonText[751] = "军团排名"
CommonText[752] = {"大厅等级：","科技等级：","福利院等级：","建设度"}
CommonText[753] = "圣诞返利"
CommonText[754] = {"节日返利","节日欢庆","开服狂欢","开服返利"}
CommonText[755] = {"活动期间充值相应档次可开启对应的礼包，获取10%-300%金币返利","活动期间全服玩家充值或采集资源获取欢庆值，欢庆值达到指定值可领取全服奖励","开服期间全服玩家充值或采集资源获取欢庆值，欢庆值达到指定值可领取全服奖励","开服期间充值相应档次可开启对应的礼包，获取20%~200%金币返利"}
CommonText[756] = "%s元%s"
CommonText[757] = {"采集","前往充值"}
CommonText[758] = "功能暂未开启"
CommonText[759] = "恭喜您充值成功，是否立即前去邮件领取首充礼包"
CommonText[760] = "当前欢庆:"
CommonText[761] = "欢庆%s\n可领取"
CommonText[762] = "可以替代任意一种配件碎片"
CommonText[763] = {"幸运转盘","配件转盘","能晶转盘", "装备升星转盘","战术转盘"}
CommonText[764] = {"我的积分：","当前排名：","活动结束时结算排行"}
CommonText[765] = {"探索","排行", "每日目标"}
CommonText[766] = "探索%s次"
CommonText[767] = "是否花费%s金币进行探索?"
CommonText[768] = "未上榜"
CommonText[769] = {"查看奖励","不可领取","领取奖励"}
CommonText[770] = {"排名","角色名","积分"}
CommonText[771] = "奖励一览"
CommonText[772] = "第%s名"
CommonText[773] = "勤劳致富"
CommonText[774] = {"采集","排行榜"}
CommonText[775] = "%s采集"
CommonText[776] = "已采集："
CommonText[777] = {"领取奖励","不可领取","已领取"}
CommonText[778] = "虚位以待"
CommonText[779] = "榜"
CommonText[780] = {"排名","角色名","采集"}
CommonText[781] = "免费探索"
CommonText[782] = "渠道名不能为空"
CommonText[783] = "资源点的敌军近期缴获了一批宝图碎片、传闻拼凑齐碎片可获得藏宝图，开启获得传说中的哈洛克宝藏"
CommonText[784] = {"去收集","拼合宝图"}
CommonText[785] = "小贴士：拼合后可获得宝图(存放于背包中)"
CommonText[786] = "碎片不足，无法合成!"
CommonText[787] = "哈洛克信物不足，是否花费%s金币打开宝图？"
CommonText[788] = {"活动期间，每日一次免费拉取机会！","拉取可获得大量高阶坦克！"}
CommonText[789] = {"特等奖励","一等奖励","二等奖励"}
CommonText[790] = "勾选获取10倍奖励"
CommonText[791] = "拉取"
CommonText[792] = "免费拉取"
CommonText[793] = "是否花费%s金币进行拉取?"

CommonText[794] = "百团混战"
CommonText[795] = {"团战报名","百团战场","排行"}
CommonText[796] = {"报名状态：","本军团已报名玩家："}
CommonText[797] = {"还未开始报名","未报名","已报名","准备战斗"}
CommonText[798] = {"参与军团","报名","取消报名","查看阵型"}
CommonText[799] = {"报名时间","角色名","等级","阵型战力"}
CommonText[800] = {"目前已报名军团数：","少于10个军团报名，自动取消军团混战"}
CommonText[801] = {"等级","军团名称","人数","战力"}
CommonText[802] = {"连胜排行","军团排行"}
CommonText[803] = {"连胜奖励","奖励一览"}
CommonText[804] = {"排名","角色名","连胜次数","参战战力"}
CommonText[805] = {"排名","军团名","参战人数","参战战力"}
CommonText[806] = {"全服战况","军团战况","个人战况"}
CommonText[807] = {"时间","攻击方","防守方","攻方战果"}
CommonText[808] = "查看个人战报"
CommonText[809] = {"失败","%s连胜"}
CommonText[810] = {"本次军团战结束,","获得第1名"}
CommonText[811] = {"被","淘汰，获得第%s名"}
CommonText[812] = {"时间","攻击方","防守方","播放战报"}
CommonText[813] = "总数:"
CommonText[814] = "确认报名"
CommonText[815] = "百团混战报名"
CommonText[816] = {"报名时间:19:30~19:55","每周一、三、六开启"}
CommonText[817] = "军团战中获得奖品，军团长可以分配给团员"
CommonText[818] = "分配"
CommonText[819] = "至少选择一个需要被分配的成员"
CommonText[820] = "分配成功！"
CommonText[821] = {"军团采集加速","百团混战第一奖励，全军团成员生效","资源采集加速20%（持续18小时）"}
CommonText[822] = "数量不足，请重新选择分配数量和成员"
CommonText[823] = "疯狂歼灭"
CommonText[824] = {
	"百团混战报名已经开始，请指挥官们前往军团作战中心参战！",
	"百团混战报名将在19:55结束，请未报名的指挥官们抓紧时间报名！",
	"百团混战报名已经结束，战斗即将打响！",
	"百团混战已经打响，指挥官们可前往军团作战中心查看战况！",
	"本次百团混战已经结束，敬请期待下次大战！",
	"由于参战军团不足十个，本次百团混战无法进行，请期待下次大战！"
}

CommonText[825] = {
	"当日歼灭坦克%s辆，可获得奖励",
	"当日歼灭战车%s辆，可获得奖励",
	"当日歼灭火炮%s辆，可获得奖励",
	"当日歼灭火箭%s辆，可获得奖励",
	"累计歼灭任意兵种%s辆，可获得奖励"
}
CommonText[826] = "任务奖励"
CommonText[827] = {"报名中","准备战斗","战斗进行中","战斗已结束"}
CommonText[828] = {"歼灭","排行榜"}
CommonText[829] = {"合成","研究"}
CommonText[830] = "技术革新"
CommonText[831] = {"未知道具","兑换配方:","现有数量:"}
CommonText[832] = {"歼灭坦克","歼灭战车","歼灭火炮","歼灭火箭","全军歼灭"}
CommonText[833] = "兑换一次"
CommonText[834] = {"军团科技","军团战","军团副本","军团商店","军团驻军"}
CommonText[835] = {"多种科技加成，轻松提升你的战斗力！","军团之间的争夺战，超高资源加成，战场称王！","挑战你的极限，更多奖励任意领！","超值稀有道具，免费兑换！","与战友一起抵御，轻松击退强敌！"}
CommonText[836] = {"创建军团","加入军团"}
CommonText[837] = "创建/加入军团即可"
CommonText[838] = "每日充值"
CommonText[839] = "每日充值任意金额即可领取，奖励每日刷新"
CommonText[840] = "有未领取的附件，是否确认删除？"
CommonText[841] = "邮件列表中包含未领取附件的邮件，是否确认删除？"
CommonText[842] = "今日已领取"
CommonText[843] = {"招募","排行榜"}
CommonText[844] = "招募%s次"
CommonText[845] = "未知将领"
CommonText[846] = "尊享VIP"
CommonText[847] = "恭喜您达到"
CommonText[848] = {
	"成为我们的最新VIP用户",
	"我们将为您单独安排妹纸客服",
	"为您一对一服务",
	"请加妹纸QQ",
	"等你哦！"
}
CommonText[849] = "(可从VIP界面再次查看)"
CommonText[850] = "您的收藏数已达上限"
CommonText[851] = "编辑保存成功"
CommonText[852] = "活动已结束"
CommonText[853] = "剩余时间:"
CommonText[854] = {"%d天%02d小时%02d分%02d秒","%02d小时%02d分%02d秒","%02d分%02d秒"}
CommonText[855] = "功能开启"
CommonText[856] = "去看看"
CommonText[857] = "好友推荐"
CommonText[858] = "一键添加"
CommonText[859] = "好友添加成功"
CommonText[860] = "指挥官等级达到15级才能发邮件"
CommonText[861] = {"拥有次数：","(每消费199金币获得1次转轮机会)"}
CommonText[862] = {"免费转轮","单次轮盘","十次轮盘"}
CommonText[863] = "次数不足"
CommonText[864] = {"水晶城","荒漠城","科技城"}
CommonText[865] = "资格时间"
CommonText[866] = "资格时间内，累计充值%s金币，可度假"
CommonText[867] = "度假"
CommonText[868] = {
	"是否花费%s金币去水晶城度假，购买后您将错过前往荒漠城或科技城度假的更好选择，您确定这么做吗？",
	"是否花费%s金币荒漠城度假，购买后您将错过前往科技城度假的更好选择，您确定这么做吗？",
	"是否花费%s金币去科技城度假，购买后将无法去其他地方度假"
}
CommonText[869] = {"度假后即领","第%s天可领取"}
CommonText[870] = {"不可领取","领取","已领取"}
CommonText[871] = "已结束"
CommonText[872] = "拥有配件芯片:"
CommonText[873] = "需要芯片:"
CommonText[874] = "配方%d兑换"
CommonText[875] = "今日可兑换次数：%s"
CommonText[876] = {"免费刷新","刷新"}
CommonText[877] = "我要兑换"
CommonText[878] = "是否花费%s金币进行刷新?"
CommonText[879] = "刷新成功!"
CommonText[880] = {"招募幸运值","满幸运值招募必出%s"}
CommonText[881] = "配件芯片"
CommonText[882] = {"活动说明:","活动期间累计充值指定金币可获下注机会赢取金币！"}
CommonText[883] = {"我的充值：","剩余次数："}
CommonText[884] = "次数不足，请先去充值"
CommonText[885] = "是否花费%s金币进行下注?"
CommonText[886] = {"活动说明：","活动期间，每充值满%d金币可进行抽奖!"}
CommonText[887] = "该渠道创建角色功能暂时关闭!"
CommonText[888] = "使用成功,个人军团贡献增加%s点"
CommonText[889] = {"军团大厅捐献","军团科技捐献"}
CommonText[890] = {"获得建设度和贡献增加50%","获得科技经验和贡献增加50%"}
CommonText[891] = {"军团建设度","军团贡献","科技经验"}
CommonText[892] = "去捐献"
CommonText[893] = {"当前排名:","战斗力:","总贡献:"}
CommonText[894] = {"排名","军团名","战斗力","总贡献"}
CommonText[895] = {"超值道具 海量资源","全属性提高10%","总计提供300m加速","10000战力提升"}
CommonText[896] = "只有军团长才能使用军团铭牌"
CommonText[897] = "没有足够的同阶将领"
CommonText[898] = "目前可进阶%s个将领，是否消耗%s个进阶石进行一键进阶"
CommonText[899] = "举报"
CommonText[900] = "确定举报[%s]吗?"
CommonText[901] = "已成功举报该玩家"
CommonText[902] = {"锁定","解锁"}
CommonText[903] = "配件%s成功"
CommonText[904] = {"带兵数量+%s","技能等级上限提升","%s资历开启","新建筑开启:%s"}
CommonText[905] = "点击屏幕继续"
CommonText[906] = {"专属挂件","每日首充任意金额即可领取","活动时间已接近尾声，是否确认祈福?"}
CommonText[907] = {"活动期间累计充值4天可领取专属挂件","已达成："}
CommonText[908] = {"每充值满2000金币可领取(可重复领)","可领次数："}
CommonText[909] = {"劳动","光荣"}
CommonText[910] = "活动期间攻打征战关卡，世界资源点或玩家基地胜利后，有概率获得劳动卡"
CommonText[911] = "我的劳动卡"
CommonText[912] = {"点击劳动","劳动中...","领取奖励"}
CommonText[913] = "我的祝福宝石"
CommonText[914] = {"祝福","数量:"}
CommonText[915] = "祝福成功!"
CommonText[916] = "是否花费%d金币立即消除劳动时间?"
CommonText[917] = "军工科技"
CommonText[918] = "研发"
CommonText[919] = "军工改装"
CommonText[920] = "本类研发点数:"
CommonText[921] = "研发点数:"
CommonText[922] = "装配数:"
CommonText[923] = "解锁军工科技"
CommonText[924] = "材料关卡"
CommonText[925] = {"科技升级","科技装配"}
CommonText[926] = {"掌控","改装","效率"}
CommonText[927] = {"研究要求","科技效果","适用范围","消耗材料"}
CommonText[928] = "未装配"
CommonText[929] = "未解锁"
CommonText[930] = "(已装配)"
CommonText[931] = "已装配同类"
CommonText[932] = "军工科技槽"
CommonText[933] = "类型："
CommonText[934] = "解锁消耗"
CommonText[935] = {"10倍模式","锁定坦克"}
CommonText[936] = {"探索","改装"}
CommonText[937] = "目前最厉害的坦克，没有之一"
CommonText[938] = {"普通探索","高级探索"}
CommonText[939] = {"点击坦克模型可查看坦克详情","点击卡牌处可选择探索模式"}
CommonText[940] = "概率获得:"
CommonText[941] = {"能晶", "能晶信息"}
CommonText[942] = "镶嵌"
CommonText[943] = {"第%d部队能晶","勾选显示指定颜色格子镶嵌的能晶"}
CommonText[944] = {"镶嵌属性","隐藏属性"}
CommonText[945] = {"1.装配3个5级或者5级以上的能晶","2.装配3个6级或者6级以上的能晶","3.装配3个7级或者7级以上的能晶"}
CommonText[946] = {"红色","蓝色","黄色"}
CommonText[947] = {"[[\"是否确定卸下\"],[\"%sLv.%d\"]]", "提示：","[[\"    是否确定以概率\"],[\"%s\"],[\"合成\"],[\"%d\"],[\"次\"],[\"     %sLv.%d\"]]"}
CommonText[948] = {"批量合成","已放入数量：","当前合成概率：", "合成结果", "成功次数: %d", "失败次数: %d"}
CommonText[949] = {"能晶已达最高等级,无法合成"}
CommonText[950] = {"镶嵌成功","拆卸成功"}
CommonText[951] = {"祭坛等级：","升级需求：","总建设度：","军团等级："}
CommonText[952] = {
[1] = "祭坛等级不能超过军团等级/5",
[2] = "军团等级20级开放",
[3] = "军团BOSS召唤处于冷却中",
[4] = "建设度不足，召唤军团BOSS需要%d点建设度",
[5] = "军团BOSS挑战已经结束",
[6] = "入团满7天的军团成员才可以挑战",
[7] = "只有军团长和副军团长可以召唤",
[8] = "军团BOSS已经召唤，暂时不能升级祭坛",
[9] = "此次召唤军团BOSS需要%d点建设度，是否确定召唤？"}

CommonText[953] = {"祭坛BOSS","召唤后即可攻打","召唤","参与奖励","未召唤"}
CommonText[954] = "增加部队%s的%s"
CommonText[955] = "召唤军团BOSS成功"
CommonText[956] = {"召唤冷却","挑战准备","挑战结束"}
CommonText[957] = {"军团BOSS未召唤"}
CommonText[958] = {"已达等级上限"}
CommonText[959] = {"世界地图玩法说明"}
CommonText[960] = {"攻打敌人","资源采集","团友协防"}
CommonText[961] = "欢迎来到世界地图，精彩而刺激的战争时刻立即开启！"

CommonText[962] = "当前登录天数:"
CommonText[963] = "能量赠送"
CommonText[964] = "活动时间"
CommonText[965] = {"活动期间登录即送能量","能量上限不能超过100哦!"}
CommonText[966] = {
[1] = "攻击：基础伤害能力",
[2] = "攻击方式：一共四种，分别为横排攻击、单一攻击、竖排攻击、全军攻击",
[3] = "生命：可承受的最大伤害",
[4] = "载重：装载资源的最大数量",
[5] = "命中：击中敌方的几率",
[6] = "闪避：躲避攻击的几率",
[7] = "暴击：攻击造成暴击的几率",
[8] = "抗暴：减少被暴击的几率",
[9] = "穿刺：造成额外伤害，并有几率打出穿刺效果，使被击中目标丧失战斗能力",
[10] = "防护：减少受到的伤害，减少被穿刺的几率",
[11] = "爆裂：增加造成暴击时的伤害",
[12] = "坚韧：减少受到暴击时的伤害",
[13] = "震慑：进一步强化部队伤害",
[14] = "刚毅：减弱对手震慑的作用效果"}
CommonText[967] = "活动暂未开启，敬请期待。"
CommonText[968] = "离线超过24小时将不再有资源产出"
CommonText[969] = "将领不存在或已出战"
CommonText[970] = {"将领锁定成功","将领解锁成功"}
CommonText[971] = "将领已锁定"
CommonText[972] = "活动期间，每充值满%s金币可获得1次转盘机会(最多10次)"
CommonText[973] = "统率等级已达上限"
CommonText[974] = "声望等级已达上限"
CommonText[975] = "觉醒任务"
CommonText[976] = "活动介绍:"
CommonText[977] = "充值越多,可下注次数越多,赢取金币也越多!"
CommonText[978] = {"秘药觉醒","金币觉醒"}
CommonText[979] = "觉醒失败,成功概率提升!"
CommonText[980] = "开启觉醒"
CommonText[981] = {"普通","觉醒"}
CommonText[982] = "是否花费%s金币觉醒"
CommonText[983] = {"未完成","已完成"}
CommonText[984] = "您的觉醒将领已经出征了!"
CommonText[985] = "无"
CommonText[986] = "将领已出战"
CommonText[987] = "开启觉醒后，将领可继续升级，但无法进阶或分解，是否开启觉醒？"
CommonText[988] = "倍"
CommonText[989] = {"侦查状态：","%d分钟前侦查","未侦查"}
CommonText[990] = "占领中"
CommonText[991] = {"签到","累计签到，可获得以下奖励"}
CommonText[992] = {"VIP%dx%d倍","当日签到奖励已领取。升级至对应VIP等级可领取双倍奖励，是否充值？"}
CommonText[993] = "工厂状况"
CommonText[994] = {"我的战事","战友战事"}
CommonText[995] = {"防守信息","指挥官数量:","兵力数量:","飞艇坚固程度:","总战力:"}
CommonText[996] = {"进攻","撤销集结","消耗集结令","即刻发兵","%s后自动发兵","%s后到达目标","%s队伍返回"}
CommonText[997] = {"创建战事成功！","撤销成功！"}
CommonText[998] = {[15]="飞艇部队(准备中)",[16]="飞艇部队(行军中)",[17]="飞艇部队(驻防行军中)",[18]="飞艇部队(驻防中)"}
CommonText[999] = {"发起者:","当前部队数量:","加入"}
CommonText[1000] = {"驻防","飞艇驻防","点击飞艇驻防"}
CommonText[1001] = {"出战序列决定了上阵优先级，排在前面的玩家会优先与敌方交战","飞艇在万不得已的情况下参战，若飞艇被击毁则防守失败"}
CommonText[1002] = {"攻\n击\n方","防\n守\n方"}
CommonText[1003] = {"归属:","军团集结","将领","生产完成:"}
CommonText[1004] = "撤军需要消耗%s,且无法重新设置进攻队伍，确定返回？"
CommonText[1005] = {"保护剩余时间:","飞艇受保护中"}
CommonText[1006] = "撤销集结后战事将会取消,确定执行?"
CommonText[1007] = {"位置:","等级:","战斗力:","耐久度:","每次修复时固定回复5%耐久度","占领据点后可用军功来征收丰厚物资奖励","修复所需资源"}
CommonText[1008] = {"发送邮件","重建"}
CommonText[1009] = {"飞艇修复完成后将生产物资,指挥官可以使用军功来收获","被任命的指挥官可以在每日21点收获双份物资奖励"}
CommonText[1010] = {"要塞官职","飞艇指挥官"}
CommonText[1011] = "未设置部队不能发兵"
CommonText[1012] = {"飞艇任命候选人","请先选择一名团员"}
CommonText[1013] = {"淬炼暴击","配件淬炼有几率造成经验暴击"}
CommonText[1014] = {"达成要求","附加属性"}
CommonText[1015] = "升级军衔"
CommonText[1016] = {"资源(%s)没有满足条件，不能升级！","已达到最高级"}
CommonText[1017] = {"军功","我的军功","我的军衔","军功由战斗累积而来，用于提升军衔","每日获得军功不会超过%s"}
CommonText[1018] = "军功获得"
CommonText[1019] = "满"
CommonText[1020] = "这些氪金宝箱传说是一位神秘的淬炼大师留下的遗产，其中蕴藏着无数的宝藏。只有使用淬炼留下的氪金锭，才能打开这些神奇的箱子。"
CommonText[1021] = {"淬炼大师:","嘿！快使用氪金锭去寻宝，还有很多客户在等着我呢！"}
CommonText[1022] = "去寻宝吧"
CommonText[1023] = "关闭"
CommonText[1024] = {"开启一次","开启十次","开启百次"}
CommonText[1025] = "氪金锭不足，快去淬炼吧！"
CommonText[1026] = "消耗:"
CommonText[1027] = "去获取"
CommonText[1028] = {"寻宝","排名"}
CommonText[1029] = "75级开启配件淬炼，要加油哟！"
CommonText[1030] = {"恭喜","开启氪金宝箱获得"}
CommonText[1031] = {"开启氪金宝箱，可能获得资源、改造材料、配件碎片箱和万能碎片。单抽出奇迹。","开启氪金宝箱，可能获得资源、改造材料、配件碎片箱和万能碎片。十连毁一生。","开启氪金宝箱，可能获得资源、改造材料、配件碎片箱和万能碎片。百抽奇迹现。"}
CommonText[1032] = "查看结果"
CommonText[1033] = "哎呀！活动已结束，无法获得氪金锭啦！"
CommonText[1034] = "中立"
CommonText[1035] = "物资正在生产中,请等待!"
CommonText[1036] = "是否花费%s进行本次侦查?"
CommonText[1037] = "指挥官只能创建一个战事!"
CommonText[1038] = "飞艇需要修复后才能驻防!"
CommonText[1039] = "不足，无法撤回行军!"
CommonText[1040] = "带兵量"
CommonText[1041] = "洗练完成"
CommonText[1042] = "洗练属性"
CommonText[1043] = "确定消耗%d个金币执行%s吗?"
CommonText[1044] = "确定将指挥官由%s替换为%s吗?"
CommonText[1045] = {"未激活","蓝色以上品质军备激活","紫色色以上品质军备激活","神秘洗练"}
CommonText[1046] = "不足，无法领取奖励!"
CommonText[1047] = "消耗%s领取奖励?"
CommonText[1048] = {"容我三思","全力出击"}
CommonText[1049] = "    立刻发动一场针对%s的战斗,您今日还有%d次免费发动集结的机会."
CommonText[1050] = {"是否发起军团集结?","是否消耗%d个%s发起军团集结?"}
CommonText[1051] = "飞艇未解锁!"
CommonText[1052] = "奖励征收"
CommonText[1053] = {"已装备","未装备"}
CommonText[1054] = "暂无军备"
CommonText[1055] = {"需要能量","注入能量","点击宝箱","领取奖励"}
CommonText[1056] = {"温馨提示","活动刷新啦，请重进活动界面查看吧！","准奏"}
CommonText[1057] = {"奖励领取成功","奖励","单日能量灌注达标，即可领取以下奖励","连续三日能量灌注全部达标，自动免费领取以下奖励"}
CommonText[1058] = {"每充值1元,自动注入10能量","连续三日充能达标,豪华礼包","免费送"}
CommonText[1059] = {"皮肤","基地外观","行军效果"}
CommonText[1060] = {"普通皮肤","特殊皮肤","特殊气泡"}
CommonText[1061] = {"购买","更换","不可购买","使用","续购"}
CommonText[1062] = {"基地外观","皮肤效果","使用成功","更换成功"}
CommonText[1063] = "显示网络延迟"
CommonText[1064] = "军衔"
CommonText[1065] = {"征收记录","征收了","消耗了"}
CommonText[1066] = {"女神","祝福"}
CommonText[1067] = "活动期间攻打征战关卡，世界资源点或玩家基地胜利后，有概率获得祝福宝石"
CommonText[1068] = "我的祝福宝石"
CommonText[1069] = {"点击祝福","祝福中...","领取奖励"}
CommonText[1070] = {"累计充值%d元即可选择一份礼物","期间每充值达到一定额度,","即可选一份自己喜欢的礼物,","每天0点重置次数和领取资格。"}
CommonText[1071] = {"朕意已决","容我三思"}
CommonText[1072] = "确定选择领取此礼包吗？"
CommonText[1073] = "先手值"
CommonText[1074] = {"任务1","任务2"}
CommonText[1075] = {"去打飞艇","获得增益"}
CommonText[1076] = {"攻打飞艇赢礼包","占领飞艇赢礼包"}
CommonText[1077] = {"活动期间内，在攻击或防守飞艇的战斗中，损失降低%d%%。","请先加入一个军团吧，指挥官大人。","激活了","升级了",
					"飞艇增益","次","是否花费%d%s升级BUFF？","成功占领1次飞艇","军团成员升级成功"}
CommonText[1078] = {"身份名牌","聊天气泡"}
CommonText[1079] = {"铭牌效果","获取途径"}
CommonText[1080] = "VIP%d级以上可使用"
CommonText[1081] = "超过%d个字符限制"
CommonText[1082] = {"替换","替换配件"}
CommonText[1083] = "%d级以上可参加活动"
CommonText[1084] = {"摧毁敌军 缴获勋章","活动期间:勋章升级无冷却时间！","我的荣誉勋章:","吃鸡数量:","当前排行:","剩余时间：","剩余时间：","去升级","索敌","吃鸡数"}
CommonText[1085] = "已拥有"
CommonText[1086] = "吃我"
CommonText[1087] = {"歼敌","兑换","排行榜"}
CommonText[1088] = {"跳过动画","必出三橙","一键十倍"}
CommonText[1089] = "是否花费%d%s索敌？"
CommonText[1090] = {"免费:","消费:","金币"}
CommonText[1091] = {"活动期间，勋章升级无冷却时间，抓紧机会呦！","获取材料"}
CommonText[1092] = "活动期间无冷却时间"
CommonText[1093] = {"大吉大利，晚上吃鸡。","全歼敌军，请重新索敌。"}
CommonText[1094] = {"前往充值","金币不足，请前往充值！"}
CommonText[1095] = "您还有未领取的经历或未完成的活动，确定要放弃这些吗？"
CommonText[1096] = "总价"
CommonText[1097] = "%d级解锁%s玩法，指挥官大人请加油哟！"
CommonText[1098] = "能量管理"
CommonText[1099] = {"能量条","一键充能"}
CommonText[1100] = {"请先选择要使用的能量条道具","您没有","无法使用","一键充能成功"}
CommonText[1101] = "飞艇耐久度"
CommonText[1102] = "开服第%s天解锁该飞艇!"
CommonText[1103] = "需要先解锁%s才能解锁该飞艇"
CommonText[1104] = "零损兵"
CommonText[1105] = "飞艇简介"
CommonText[1106] = "驻防目标无效"
CommonText[1107] = "同一个集结战事中,指挥官只能派遣一支部队参与战斗!"
CommonText[1108] = "同一个飞艇,指挥官只能派遣一支部队参与防守!"
CommonText[1109] = "本轮回合已达上限,进攻方失败!"
CommonText[1110] = "出征将领"
CommonText[1111] = "需要军团等级%d级才能攻打该飞艇"
CommonText[1112] = "当前飞艇需要修复,否则在保护时间过期后,飞艇将会恢复为中立状态."
CommonText[1113] = "已加入"
CommonText[1114] = "加入集结"
CommonText[1115] = {"秘密武器","研究劵","研究","开启新技能","研究券(%d)","武器"}
CommonText[1116] = {"无法","成功"}
CommonText[1117] = "是否花费%d金币%s？"
CommonText[1118] = "兵种特效"
CommonText[1119] = "应用"
CommonText[1120] = "敬请期待！"
CommonText[1121] = "任意%s配件改造到%d级激活"
CommonText[1122] = "正在使用中"
CommonText[1123] = "小提示：强化和改造能使你的配件更强力！"
CommonText[1124] = "小提示：任一部位配件改造到10，将激活炫酷攻击特效！"
CommonText[1125] = "前方高能，需指挥官达到%d级"
CommonText[1126] = {"意念骰子","糟糕！指挥官，我们的意念骰子已经用光啦！"}
CommonText[1127] = {"精力药剂","精力补充成功，当前剩余精力:","精力不足,是否使用精力药水？",
					"精力不足,是否花费%d金币购买并使用！","可回复%d点精力",
					"精力不足，请使用精力药剂！","剩余精力"}
CommonText[1128] = "购买并使用"
CommonText[1129] = "跑圈奖励"
CommonText[1130] = {"打折商品","是否花费%d金币购买打折商品"}
CommonText[1131] = "拒绝"
CommonText[1132] = "当前研究次数:"
CommonText[1133] = {"您需要达到60级！","前往研究"}
CommonText[1134] = {"谍报能力","逃脱能力"}
CommonText[1135] = "间谍已派出!"
CommonText[1136] = "间谍列表"
CommonText[1137] = "任务描述"
CommonText[1138] = "预计完成时间"
CommonText[1139] = {"固定产出","可能产出"}
CommonText[1140] = "派遣"
CommonText[1141] = "搜集情报中..."
CommonText[1142] = {"是否花费%d金币派出间谍？","是否花费%d金币刷新任务？","是否花费%d金币解锁[%s]？"}
CommonText[1143] = "需解锁前置区域[%s]"
CommonText[1144] = {"升级材料不足","升级CD已满","升级成功"}
CommonText[1145] = "一键升级"
CommonText[1146] = {"第一天","第二天","第三天","第四天","第五天","第六天"}
CommonText[1147] = "累计登录6天领取礼包("
CommonText[1148] = "累计登录未满6天，无法领取奖励！"
CommonText[1149] = "没有可领取奖励"
CommonText[1150] = "所需贡献度不足,无法领取特殊奖励"
CommonText[1151] = "领取成功，消耗贡献度%d"
CommonText[1152] = "一键捐献"
CommonText[1153] = {"铁","石油","铜","钛","水晶"}
CommonText[1154] = "捐献条件不足,无法捐献。"
CommonText[1155] = {"是否消耗：","完成一键捐献？"}
CommonText[1156] = "问卷已作答"
CommonText[1157] = "参与有奖问卷，赢取惊喜大礼，有您的宝贵意见游戏才能变的更好哦~"
CommonText[1158] = {"上一题","下一题"}
CommonText[1159] = "提交"
CommonText[1160] = "第%d题"
CommonText[1161] = "点击输入内容..."
CommonText[1162] = "请先对当前问题作答"
CommonText[1163] = "尊敬的指挥官，您的问卷填写尚未完成，完成全部问卷有惊喜礼物哦，您确定要退出吗？"
CommonText[1164] = "是否一键领取所有免费奖励，部分奖励需要消耗%s点贡献度？"
CommonText[1165] = {"开服钜惠"}
CommonText[1166] = "战车/改装工厂单次生产上限增加"
CommonText[1167] = {"扫荡设置","一键扫荡"}
CommonText[1168] = {"今日剩余探险次数：","购买次数","今日还可购买","花费：",
					"当前扫荡关卡：","请设置扫荡方案","花费金币：%s","拥有金币：%s",
					"保存方案","三星通关方可选择","请选择关卡","金币"}
CommonText[1169] = "保存成功"
CommonText[1170] = "有几率获得："
CommonText[1171] = "暂无可扫荡副本"
CommonText[1172] = "确定花费%d%s一键扫荡吗？"
CommonText[1173] = "扫荡方案设置冲突，请重新设置"
CommonText[1174] = "探险副本有更新，请重新设置扫荡方案"

 
CommonText[100000] = {"任务集星","配件探险","生产坦克","强化配件"}
CommonText[100001] = {"竞技场","战役关卡","资源采集","攻打玩家"}
CommonText[100002] = {"百团大战","军事演习","世界BOSS","要塞战"}
CommonText[100003] = {"充值活跃","招募将领","消费活跃"}
CommonText[100004] = "本周期剩余时间："
CommonText[100005] = "本周期已结束，正在清算。"
CommonText[100006] = {"每周一12：00结算本周期的活跃度积分。","每周一13：00开启新周期的活跃的积分计算。"}
CommonText[100007] = "指挥官，您当前处于活跃度第%d阶段，您还有%d个阶段的奖励可以完成。"
CommonText[100008] = "活跃度任务"
CommonText[100009] = "老玩家回归"
CommonText[100010] = "回归礼包领取"
CommonText[100011] = {"回归充值返利","专属您的充值返利"}
CommonText[100012] = {"未激活","已激活"}
CommonText[100013] = {"回归大礼包","回归加成","回归返利"}
CommonText[100014] = {"日常任务","体力任务","限时活动","极限任务"}
CommonText[100015] = {"活动","限时活动","跨服活动","老玩家回归"}
CommonText[100016] = "确定消耗%d个%s进行补签吗?"
CommonText[100017] = "充值返利已结束。"
CommonText[100018] = "激活将领技能%s,%s"
CommonText[100019] = "参谋选取"
CommonText[100020] = "未拥有该类型将领"
CommonText[100021] = "回归状态已结束。"
CommonText[100022] = "将领已在参谋部上任"
CommonText[100023] = "参谋卸下"
CommonText[100024] = "将领数量不足"
CommonText[100025] = "补签"
CommonText[100026] = "一键领取"
CommonText[100027] = "%d天过期"
CommonText[100028] = "邮箱容量上限为100封，超过会删除最旧的邮件！"
CommonText[100029] = "即将过期"
CommonText[100030] = "指挥官，您的邮件数量过多，请及时清理！"
CommonText[100031] = "邮件收藏已达上限(10封)"


CommonText[5000] = "淬炼"
CommonText[5001] = "进阶"
CommonText[5002] = "进阶消耗"
CommonText[5003] = "(进阶后不保留改造和强化等级)"
CommonText[5004] = "材料返还"
CommonText[5005] = "(进阶后返还部分水晶和全部材料)"
CommonText[5006] = "只有改造4级以上的紫色配件才能进阶为橙色配件"
CommonText[5007] = "进阶最大等级"
CommonText[5008] = "淬炼等级："
CommonText[5009] = "淬炼属性："
CommonText[5010] = "激活属性："
CommonText[5011] = "(强化%d且改造%d以上激活)"
CommonText[5012] = "(%s淬炼达到%s以上激活)"
CommonText[5013] = "淬炼方式"
CommonText[5014] = {"专家","大师"}
CommonText[5015] = {"十次淬炼","百次淬炼","千次淬炼"}
CommonText[5016] = "同时满足以下勾选条件时自动保存"
CommonText[5017] = "%s不变或者提高"
CommonText[5018] = {"花费%s金币进行10次淬炼？","花费%s金币进行100次淬炼？","花费%s金币进行1千次淬炼？"}
CommonText[5019] = "直接完成"
CommonText[5020] = "第%s次淬炼结果"
CommonText[5021] = "最终结果"
CommonText[5022] = "再来一次"
CommonText[5023] = "当前%s淬炼上限:"
CommonText[5024] = "无法进阶"
CommonText[5025] = "无法淬炼"
CommonText[5026] = "经验暴击x%s："
CommonText[5027] = "去淬炼"
CommonText[5028] = {"战场","军火商"}
CommonText[5029] = {"红色方案","军火商店"}
CommonText[5030] = "我的物资："
CommonText[5031] = "出击"
CommonText[5032] = {"完美通关后即可领取宝箱","燃料太多了，请指挥官大人先消耗一些吧！"}
CommonText[5033] = "瞧一瞧\n看一看咯~"
CommonText[5034] = {"红色","方案"}
CommonText[5035] = "是否花费%d金币购买%d点燃料"
CommonText[5036] = "燃料不足"
CommonText[5037] = "完美通关%s可领取奖励"
CommonText[5038] = "扫荡十次"
CommonText[5039] = "挑战"
CommonText[5040] = "通缉令"
CommonText[5041] = "探索度"
CommonText[5042] = "功能解锁:"
CommonText[5043] = "点击任意地方关闭"
CommonText[5044] = {"每天登录可领取奖励","攻打关卡/矿点/基地，概率获得%s","活动期间可购买%s"}
CommonText[5045] = {"登录有礼","关卡/矿点掉落","道具售卖"}
CommonText[5046] = {"领取","前往","购买"}
CommonText[5047] = "我的%s："
CommonText[5048] = {"批量购买","批量兑换"}
CommonText[5049] = "提示：活动结束，活动道具将会清零。"
CommonText[5050] = "活动说明：活动期间可进行坦克转换"
CommonText[5051] = "剩余时间："
CommonText[5052] = "转换数量："
CommonText[5053] = {"购  买", "转  换"}
CommonText[5054] = "%s不足，是否花费%d金币购买%d个%s？"
CommonText[5055] = "转换成功"
CommonText[5056] = "坦克数量不足"
CommonText[5057] = "第%s部队穿戴中"
CommonText[5058] = "升星成功"
CommonText[5059] = "%s不足，无法升星"
CommonText[5060] = "装备升星"
CommonText[5061] = {"升星属性","升星消耗"}
CommonText[5062] = "装备星级:"
CommonText[5063] = "加成:"
CommonText[5064] = "装备星级已满"
CommonText[5065] = {"装备消耗(","优先消耗低等级的紫装",")"}
CommonText[5066] = "升     星"
CommonText[5067] = "升星"
CommonText[5068] = "紫装消耗后不返还升级经验，是否继续？"
CommonText[5069] = "淬炼消耗"
CommonText[5070] = {"普通淬炼","专家淬炼","大师淬炼"}
CommonText[5071] = "花费%s金币进行%s？"


CommonText[1500] = {"选择支付方式","支付宝","微信","苹果官方"}
CommonText[1501] = {"亲，您的好评将是我们\n的无限动力！","残忍拒绝","给个建议","给个好评","评论"}
CommonText[1502] = "一键补充"
CommonText[1503] = "没有物资箱可以使用！"


CommonText[1600] = {"军备库","军备","军备打造","图纸"}
CommonText[1601] = {"头","眼","胸","腰","左手","右手","腿","足"}
CommonText[1602] = "军备工厂"
CommonText[1603] = {"打造","洗练","洗练方案"}
CommonText[1604] = "技工加速"
CommonText[1605] = {"雇佣技工","雇佣技工可以免费加速一次军备打造，技工持续时间累计","查看军备","已雇佣技工"}
CommonText[1606] = "请选择要分解的军备品质"
CommonText[1607] = {"军备打造时间减少","免费雇佣","暂未雇佣技工","继续雇佣","不满足条件","金币雇佣"}
CommonText[1608] = "繁荣度等级%d雇佣"
CommonText[1609] = "雇佣新技工之后,老技工的时间会叠加到新技工身上"
CommonText[1610] = "是否花费%s金币进行加速打造?"
CommonText[1611] = "没有对应的军备"
CommonText[1612] = "点击可按军备品质进行批量分解"
CommonText[1613] = "是否花费%s金币进行雇佣?"
CommonText[1614] = "指挥官等级达到%s级可打造"
CommonText[1615] = {"军备锁定成功", "军备解锁成功"}
CommonText[1616] = "军备套装"
CommonText[1617] = "已保存套装"
CommonText[1618] = {"套装一","套装二"}
CommonText[1619] = "此套装%s位置的军备已不存在"
CommonText[1620] = {"洗练属性方案一","洗练属性方案二"}
CommonText[1621] = "保存本方案"
CommonText[1622] = "解锁消耗的道具："
CommonText[1623] = {"请先解锁洗练属性方案二","当前使用方案为本方案"}
CommonText[1624] = "缺少对应消耗军备或军备穿戴中"
CommonText[1625] = "解锁将消耗%d星军备%s和金币%d,是否解锁？"
CommonText[1626] = {"洗练属性一","洗练属性二"}
CommonText[1627] = "切换属性"
CommonText[1628] = "橙色军备洗练4个满级技能后开放第2套洗练方案"
CommonText[1629] = "此队列只能用于军团驻军"
CommonText[1630] = "驻军专属，不占用其它出战玩法队列"
CommonText[1631] = {"所有邮件","系统邮件","已读邮件"}
CommonText[1632] = {"所有邮件","已读邮件"}
CommonText[1633] = {"所有邮件","空白邮件"}
CommonText[1634] = {"收藏成功","已取消收藏"}
CommonText[1635] = "未领取附件的邮件不会删除，是否执行操作？"
CommonText[1636] = {"所有邮件","已读邮件","系统邮件"}
CommonText[1637] = "是否删除%s"
CommonText[1638] = "是否一键使用所有转盘次数?"

CommonText[1700] = "是否花费%s金币扩建"
CommonText[1701] = {"繁荣度:","繁荣度上限:","预计生产时间:"}
CommonText[1702] = "已完成:"
CommonText[1703] = {"点击生产","生产","点击扩建","扩建"}
CommonText[1704] = {"欣欣向荣","平平无奇","岌岌可危"}
CommonText[1705] = {"随机绿色材料", "随机蓝色材料", "随机紫色材料", "随机橙色材料"}
CommonText[1706] = {"白色图纸", "绿色图纸", "蓝色图纸", "紫色图纸", "橙色图纸"}
CommonText[1707] = "工坊生产"
CommonText[1708] = "请选择需要生产的材料"
CommonText[1709] = "开始生产"
CommonText[1710] = "生产消耗："
CommonText[1711] = "选择消耗图纸"
CommonText[1712] = "无相应图纸"
CommonText[1713] = "所需图纸不足,无法生产"
CommonText[1714] = "解锁生产更高品质的材料"
CommonText[1715] = "数量不足，无法生产。"
CommonText[1716] = "成为VIP专享特权Buff大幅缩减建造时间"
CommonText[1717] = {"材料工坊1级开放","材料工坊2级开放","材料工坊3级开放","材料工坊4级开放"}
CommonText[1718] = {"可生产绿色材料","可生产蓝色材料","可生产紫色材料","可生产橙色材料"}
CommonText[1719] = "领取材料"
CommonText[1720] = "查看图纸"
CommonText[1721] = "材料工坊"
CommonText[1722] = "暂未开放"
CommonText[1723] = "切换形象暂未开启"
CommonText[1724] = "切换形象"
CommonText[1725] = "穿戴等级不足"
CommonText[1726] = "洗练未开放"
CommonText[1727] = "穿戴成功"
CommonText[1728] = "卸下成功"
CommonText[1729] = "技工：未雇佣"
CommonText[1730] = "打造减少时间"
CommonText[1731] = "雇佣之后可以加速打造"
CommonText[1732] = "金币加速"
CommonText[1733] = "技工加速"
CommonText[1734] = "所需材料:"
CommonText[1735] = {"打造","打造时间:"}
CommonText[1736] = "雇佣成功！"
CommonText[1737] = "持续时间:"
CommonText[1738] = "您还未拥有该类型将领"
CommonText[1739] = "精炼"
CommonText[1740] = "无法精炼"
CommonText[1741] = "已达最高品质"
CommonText[1742] = {"精炼消耗","(精炼后保留勋章升级以及打磨等级)","此品质无法精炼"}
CommonText[1743] = "超时空财团"
CommonText[1744] = {"贸易","兑换"}
CommonText[1745] = "刷新货物"
CommonText[1746] = "免费刷新次数"
CommonText[1747] = {"是否启动时空传送，刷新货物？","是否花费%d原力购买此物品？","是否花费%d金币刷新货物？"}
CommonText[1748] = "我的原力："
CommonText[1749] = "兑换消耗:"
CommonText[1750] = "精炼完成！"
CommonText[1751] = "合作愉快，我的朋友！这是代表财团白送给你的。"
CommonText[1752] = {"剩余刷新卷：","消耗金币："}
CommonText[1753] = "紫色品质勋章才能进行精炼"
CommonText[1754] = "所需道具数量不足"
CommonText[1755] = "金币不足，无法刷新"
CommonText[1756] = "后重置免费"
CommonText[1757] = "是否花费%s金币购买？"
CommonText[1758] = {"每次刷新消耗刷新券","或是金币"}
CommonText[1759] = {"升级","打磨"}
CommonText[1760] = "建造科技馆，研究高级科技。"
CommonText[1761] = {"研究院", "兵种调配所", "谍报机构","储物间"}
CommonText[1762] = {"人员分配","科技突破","建设改进"}
CommonText[1763] = {"建筑功能","建筑已解锁","需解锁前置建筑"}
CommonText[1764] = "资源储量不足"
CommonText[1765] = {"总人数","项目人数上限","合成所需碎片数","合成效率"}
CommonText[1766] = {"科技已升至满级","科技升级成功"}
CommonText[1767] = {"需","未","已"}
CommonText[1768] = {"空闲","人数","项目"}
CommonText[1769] = "前置技能"
CommonText[1770] = {"修改","完成"}
CommonText[1771] = "数量不足"
CommonText[1772] = "深度研究"
CommonText[1773] = "研究总计"
CommonText[1774] = "达成"
CommonText[1775] = "激活作战实验室科技"
CommonText[1776] = "还没有新的材料产出呢，指挥官大人~"
CommonText[1777] = "查看详情"
CommonText[1778] = "闪击行动"
CommonText[1779] = "免费领取，战力猛增"
CommonText[1780] = "立刻收编"
CommonText[1781] = "活动结束"
CommonText[1782] = "援军倒计时"
CommonText[1783] = "所有援军已抵达"
CommonText[1784] = "在科技馆研究维修小队，关卡将不再有永久战损"
CommonText[1785] = "今日领取次数已达上限"
CommonText[1786] = "我来带队"
CommonText[1787] = "笑纳了"
CommonText[1788] = {"发红包","发送红包","去发红包","去抢红包"}
CommonText[1789] = {"最大人数","人","人数","填写人数"}
CommonText[1790] = "发送频道"
CommonText[1791] = "需要创建或加入军团"
CommonText[1792] = "发 送"
CommonText[1793] = "人数必须大于%d!"
CommonText[1794] = "充值金币达到"
CommonText[1795] = "土豪发送了红包，赶紧去抢啊！"
CommonText[1796] = "金币自动补充炮弹"
CommonText[1797] = {"我","谭雅","工程师"}
CommonText[1798] = "【点击任意位置继续】"
CommonText[1799] = {"支援来了！呆在我身后，漂亮妞。我来搞定他们！","我军损失惨重，请求支援！","指挥官，敌方装甲大军正在压境。快去消灭他们吧！"}

CommonText[1800] = "我的实力"
CommonText[1801] = {"总榜", "其他榜"}
CommonText[1802] = "根据军衔,实力进行排名"

CommonText[1803] = {"安全验证", "验证码错误，请重新输入！", "验证完成！"}

CommonText[1804] = "每个任务都奖励炮弹,请好好使用他们吧!"

CommonText[1805] = "抽奖结果"
CommonText[1806] = {"单次抽取","十次抽取","再抽10次"}
CommonText[1807] = "次数不足，是否前往充值？"
CommonText[1808] = "当前奖池"
CommonText[1809] = {"每累充%d金币可获赠1次抽奖机会","剩余抽奖次数:%d(再充值%d金币可获得1次)"}
CommonText[1810] = {"包含高品质配件，是否确定分解？","包含高品质碎片，是否确定分解？","包含高品质勋章，是否确定分解？"}
CommonText[1811] = "消耗%s:"
CommonText[1812] = "勋章芯片"
CommonText[1813] = "安兴祝福"
CommonText[1814] = "喜迎100级版本-安兴的觉醒,低于90级的角色经验获取速度提高(等级越低,提速越高)"
CommonText[1815] = "当前获取速度提高%s"
CommonText[1816] = "建筑等级90级以前每级提供%d点繁荣度，90级以后每级提供%d点繁荣度"
CommonText[1817] = "请选择需要赠送的红包数量"
CommonText[1818] = "送红包一个"
CommonText[1819] = "赠送成功"
CommonText[1820] = "未拥有红包"
CommonText[1821] = "赠送每个玩家红包的数量"
CommonText[1822] = "前往升级"
CommonText[1823] = "提高所有科技研发速度100%，减少资源消耗20%。"
CommonText[1824] = "提高所有科技研发速度100%，减少资源消耗20% "--[["升级指定科技，消耗资源减少%s,时间缩短%s"--]]
CommonText[1825] = "安兴激励"
CommonText[1826] = "每日限购%d次"
CommonText[1827] = "原价%d"
CommonText[1828] = "限时%d折"
CommonText[1829] = "已达购买上限"
CommonText[1830] = "福利特惠"
CommonText[1831] = {"每日充值","每日特惠","每周特惠"}
CommonText[1832] = "提升所有建筑升级速度30%，减少资源消耗20%"
CommonText[1833] = "提升所有建筑升级速度30%，减少资源消耗20%"
CommonText[1834] = "恭喜您获得一个惊喜宝箱，请前往基地开启。"
CommonText[1835] = "每周限购%d次"
CommonText[1836] = "已购买"
CommonText[1837] = {"当前建筑升级已完成","当前生产已完成","当前研究已完成"}
CommonText[1838] = "此套装为空，请先设置"
CommonText[1839] = "当前未穿戴军备"
CommonText[1840] = "套装设置成功"
CommonText[1841] = "扫荡全部"
CommonText[1842] = "军团充值金币:"
CommonText[1843] = "军团全部成员可以领取奖励"
CommonText[1844] = {"(未达成)","(已达成)"}
CommonText[1845] = "友好度"
CommonText[1846] = "所需道具数量不足"
CommonText[1847] = "该好友本月的赠送次数已用尽。"
CommonText[1848] = {"成功使用%s，友好度+%d.","成功使用%s."}
CommonText[1849] = {"祝福已发送，友好度+%d","祝福已发送，每人友好度+%d."}
CommonText[1870] = "删除好友会将友好度清零，是否删除好友？"
CommonText[1871] = "友好度不足"
CommonText[1872] = "额外增加掠夺资源量"
CommonText[1873] = "等级达到%d级才能赠送礼物"
CommonText[1874] = "友好度达到%d才能赠送礼物"
CommonText[1875] = "额外增加被掠夺资源量"
CommonText[1876] = "本月赠送次数:"
CommonText[1877] = "本月赠送次数已达上限"
CommonText[1878] = "请选择要赠送的道具"
CommonText[1879] = "好友等级达到%d级才能接收礼物"
CommonText[1880] = {"配件碎片1-4","配件碎片5-8","军备","其他",}
CommonText[1881] = {"友好度达到","可赠送"}
CommonText[1882] = "攻击%s级Boss%s Lv.%s"
CommonText[1883] = "侦查%s级Boss%s Lv.%s"



CommonText[1850] = "礼盒剩余"
CommonText[1851] = "您已达到领取上限！"
CommonText[1852] = "红包已被领取完！"
CommonText[1853] = {"我的军团","军团击杀数","军团积分"}
CommonText[1854] = "请先加入一个军团！"
CommonText[1855] = "金额"
CommonText[1856] = "奖励记录"
CommonText[1857] = "只记录获得奖池金币的中奖信息"
CommonText[1858] = "(%d%%奖池)\n%d金币"
CommonText[1859] = "每个礼盒只能领一次哦！"
CommonText[1860] = "已达到单日红包领取上限咯！"


CommonText[1900] = {"配件转换", "(不同兵种，同部位的紫/橙色配件可以相互转换，转换后强化、改造、淬炼等级、经验、属性全部互换)"}
CommonText[1901] = {"转换消耗", "(单个紫/橙色配件转化需消耗500/800金币)"}
CommonText[1902] = "开始转换"
CommonText[1903] = "暂未开放，敬请期待"
CommonText[1904] = "是否花费%d金币购买%d个%s?"

CommonText[2000] = "拥有勋章芯片"
CommonText[2100] = "荣耀生存"
CommonText[2101] = {"荣耀生存", "荣耀排行", "荣耀金币"}
CommonText[2102] = "我知道了！"
CommonText[2103] = "前往"
CommonText[2104] = {"争取荣耀赢取丰富奖励", "每月5号, 20号开启"}
CommonText[2105] = "荣耀生存已开启，可以前往世界进行体验啦！"
CommonText[2106] = {"当前基地处于毒圈内，属性降低：", "当前基地处于安全区内，属性提升：", "属性变化不会影响战力值，只在服内战斗中生效", "当前基地处于荣耀区内，属性提升："}
CommonText[2107] = {"驻守后，每小时可采集", "荣耀积分，直到部队负重满。", "已采积分", }
CommonText[2108] = {"驻守后，每采集满1小时可采集", "金币，直到部队负重满。", "已采金币", }
CommonText[2109] = "荣耀生存已结束，快去查看你的排名吧！"
CommonText[2110] = {"积分掠夺:", "金币掠夺:"}
CommonText[2111] = "荣耀积分获得"
CommonText[2112] = {"积分", "已采集金币"}
CommonText[2113] = {"已采集积分", "荣耀", "奖励"}
CommonText[2114] = "可获得荣耀奖励:"
CommonText[2115] = "个人积分大于0才可领取奖励:"

CommonText[2200] = "技能金币"
CommonText[2201] = "将领只能在世界战斗中使用，无法读取该阵型"
CommonText[2202] = "今日清理破罩技能CD次数已用尽"
CommonText[2203] = "无法更换将领"
CommonText[2204] = "阵型中包含的将领已经失效"
CommonText[2205] = "破罩将领已经失效"

CommonText[2300] = "图片验证"
CommonText[2301] = "验证时间："
CommonText[2302] = {"选出下图中", "所有的：", "和"}
CommonText[2303] = {"您的验证操作次数过多，冻结侦察功能"}
CommonText[2304] = {"验证时间到!请重新验证"}
CommonText[2305] = "刷新次数："
CommonText[2306] = "刷新次数已达上限！"

CommonText[2400] = "矿点升级"
CommonText[2401] = "确认"
CommonText[2402] = "矿点等级"
CommonText[2403] = "矿点经验"
CommonText[2404] = "升级经验"
CommonText[2405] = "升级进度"
CommonText[2406] = "本日贡献"
CommonText[2407] = "当前效果"

CommonText[2500] = "神秘部队"
CommonText[2501] = "完成任意金额充值可领取哦"
CommonText[2502] = "领取"
CommonText[2503] = "前往充值"
CommonText[2504] = "累计充值%d天"
CommonText[2505] = "累计已充值%d天"
CommonText[2506] = "已领取"
CommonText[2507] = "活动期间，每日充值任意金额即可领取每日礼包。"
CommonText[2508] = "累计充值数日可享受累充豪礼！(每日礼包0点重置)"

CommonText[2600] = {"类别","需求","当前拥有","经验","贡献","操作"}
CommonText[2601] = {"BOSS等级：","难度星级：","星级经验："}
CommonText[2602] = "星级玩法"
CommonText[2603] = "星级捐献"
CommonText[2604] = "本次捐献会使boss经验超过上限，是否捐献？"
CommonText[2605] = "BOSS星级为0，无星级奖励"
CommonText[2606] = "BOSS血量提升%d"
CommonText[2607] = "召唤消耗建设度提升%d"
CommonText[2608] = "祭坛等级五级解锁星级功能"

CommonText[3000] = {"击杀叛军","采集资源","获取军功","排名奖励"}
CommonText[3001] = {"叛军榜","采集榜","军功榜","个人榜","军团榜"}
CommonText[3002] = {"击杀数：","采集量：","军功："}
CommonText[3003] = "本阶段积分："
CommonText[3004] = "倒计时："
CommonText[3005] = "活动未开始"
CommonText[3006] = {"个人积分：","军团积分："}
CommonText[3007] = {"角色","排行","积分","军团名"}
CommonText[3008] = "非领奖时间"
CommonText[3009] = "击杀BOSS后，从奖励库中随机掉落两个作为星级奖励"
CommonText[3010] = {"军团排名：","军团积分："}
CommonText[3011] = "未上榜"
CommonText[3012] = "暂未加入军团"

CommonText[4000] = {"坦克","战车","火炮","火箭","全兵种"}
CommonText[4001] = {"强攻","韧性","暴伤","防御"}
CommonText[4002] = {"战术","战术碎片","战术材料"}
CommonText[4003] = "战术仓库"
CommonText[4004] = {"战术碎片","战术"}
CommonText[4005] = "战术查看"
CommonText[4006] = "请选择需要消耗的战术或碎片进行升级"
CommonText[4007] = "批量选择"
CommonText[4008] = "战术升级"
CommonText[4009] = {"升  级","突  破"}
CommonText[4010] = "战术突破"
CommonText[4011] = "突破消耗："
CommonText[4012] = "突破成功"
CommonText[4013] = "所需突破材料不足"
CommonText[4014] = "可获得战术及材料"
CommonText[4015] = "已达当前最大等级"
CommonText[4016] = "没有足够的材料进行升级"
CommonText[4017] = "同属性战术每次最多佩戴三个"
CommonText[4018] = "战术克制"
CommonText[4019] = "战术克制效果："
CommonText[4020] = "装配战术属性增加50%"
CommonText[4021] = {"战术搭配","战术","加成"}
CommonText[4022] = "请选择需要消耗的战术或碎片"
CommonText[4023] = {"没有对应品质的战术","没有对应品质的战术碎片"}
CommonText[4024] = "战术中心"
CommonText[4025] = "突破上限，可继续升级提升属性"
CommonText[4026] = "指挥官达到%d级开放战术中心"
CommonText[4027] = "需要突破才能进行升级"
CommonText[4028] = "突破后可解锁更高的等级上限"
CommonText[4029] = "%d个可合成%s"
CommonText[4030] = "是否消耗%d个万能碎片合成战术？"
CommonText[4031] = {"当前部队出战时：","当前部队出战时%s："}
CommonText[4032] = {"解锁成功","成功锁定"}

CommonText[4033] = "配件碎片最低需求数量不足%d个，无法合成"
CommonText[4034] = "合成时最多使用7个万能碎片代替"

CommonText[8000] = "能源核心"
CommonText[8001] = "左右滑动可查看等级信息"
CommonText[8002] = "解锁条件"
CommonText[8003] = "每个能量原核点亮奖励"
CommonText[8004] = "完成奖励"
CommonText[8005] = "配方需求"
CommonText[8006] = "请选择物品"
CommonText[8007] = "请选择要消耗的物品"
CommonText[8008] = "选择消耗"
CommonText[8009] = "熔炼完成进入下一等级"
CommonText[8010] = {"熔炼","一键填充"}
CommonText[8011] = "暂无可消耗的道具"
CommonText[8012] = "所需材料不足，无法熔炼"
CommonText[8013] = "属性奖励"
CommonText[8014] = "能量注入"
CommonText[8015] = "一键填充"
CommonText[8016] = "注入"
CommonText[8017] = "请选择需要消耗的装备"
CommonText[8018] = "所选经验超过升级需要经验，是否确认熔炼？"
CommonText[8019] = "可解锁下一级"
CommonText[8020] = "点亮四个能量原核解锁熔炼"
CommonText[8021] = "所需材料不足"
CommonText[8022] = "点亮能量原核获得属性奖励"
CommonText[8023] = "跨服副本暂未开启"
CommonText[8024] = {"1","2","3","4","5","6"}
CommonText[8025] = "%s号位属性奖励"
CommonText[8026] = "部队%d号位"
CommonText[8027] = "所有部队"
CommonText[8028] = "跨服聊天%d级开放"
CommonText[8029] = "已注入储存经验"
CommonText[8030] = "已存储经验:"
CommonText[8031] = "服务器排名"
CommonText[8032] = "跨服军事矿区%d级开放"
CommonText[8033] = "服务器名"
CommonText[8034] = "服务器id"
CommonText[8035] = "领取奖励所需积分不足"
CommonText[8036] = "跨服军事矿区未开启"


CommonText[999999] = "账号已在其他设备登录，请重新登录"



CommonText.newer = {
	-- [1] = "指挥官，战斗即将打响，下令吧，向敌人发起攻击！",
	-- [2] = "指挥官，请继续展示您的战斗才华吧！",
	-- [3] = "指挥官阁下，欢迎来到基地！很荣幸带您参观一下我们的基地！",
	-- [4] = "作为领军的必备能力，首先让我们去提升统率和技能！",
	-- [5] = "升级统率，可以迅速增加您上阵的坦克数量，部队战斗力将大大提升！",
	-- [6] = "哇，上阵的坦克数量已经增加，接下来去升级技能！",
	-- [7] = "升级技能来让您的战斗力直接爆表！",
	-- [8] = "指挥官，去战斗吧，检验我们提升的战斗力是否货真价实！",
	-- [9] = "士兵们已经感受到您对战斗的期待，请下令吧！",
	-- [10] = "又一次大获全胜，这是从敌营缴获的装备，回基地给部队装备上！",
	-- [11] = "一键装备，快捷提升战斗力！",
	-- [12] = "前往关卡,试试新装备的威力吧！",
	-- [13] = "让我们试试新装备的威力吧！",
	-- [14] = "趁着大家士气高涨，继续进攻！",
	-- [15] = "指挥官，部队兵力吃紧，速回基地用获得的资源生产更多坦克！",
	-- [16] = "消耗资源，生产坦克",
	-- [17] = "前线告急，立即加速",
	-- [18] = "新的坦克，新的征战！",
	-- [19] = "让敌人尝尝新坦克的威力！",
	-- [20] = "趁着敌人士气低落，继续进攻！",
	-- [21] = "指挥官，坦克的生产离不开资源，回到基地，加强资源生产的建设！",
	-- [22] = "让我们先建造一个铁矿场",
	-- [23] = "要解锁更多资源建造位，需要提升司令部的等级",
	-- [24] = "升级司令部还可以提升基地中所有建筑的等级上限",
	-- [25] = "想要快速提升等级，那就去完成任务吧，还有丰厚奖励！",
	-- [26] = "领取奖励，获得大量经验",
	-- [27] = "接下来，让我们大军压境，占领敌人的聚集地！",
	-- [28] = "指挥官阁下，您已顺利完成新手任务，相信在您的带领下，军队将走向辉煌！",
	-- [29] = "接下来就要靠您自己了，我还会继续陪着您，先去看看新的任务吧，这是最快的升级方式！"
	[1] = "有了这批坦克，我们可以发起一次反击了。",
	[2] = "看那边，有情况。我们去帮帮他。",
	[3] = "谢天谢地，我得救了。哦，对了，我想这个技术应该能够帮上你们。",
	[4] = "现在，我们可以前往关卡尽情的蹂躏敌人了！",
	[5] = "打通关卡，还能获得更多的炮弹。",
	[6] = "指挥官阁下，您已顺利完成新手任务，相信在您的带领下，军队将走向辉煌！"
}

CommonText.taskGuide = {
	[1] = "选择一块空地建造铁矿厂",
	[2] = "选择一块空地建造油井",
	[3] = "选择一块空地建造铜矿厂",
	[4] = "选择一块空地建造水晶工厂",
	[5] = "选择一块空地建造钛矿厂",
	[6] = "选择任务需求的坦克进行生产",
	[7] = "选择需要征战的关卡",
	[8] = "选择需要征战的关卡",
	[9] = "授勋可快速获得声望，若已授勋，可去做日常任务",
	[10] = "在地图选择你要攻打的玩家",
	[11] = "在地图选择你要攻打的资源点",
	[12] = "在地图选择你要攻打的资源点",
	[13] = "升级或建造铁矿厂，增加产量",
	[14] = "升级或建造油井，增加产量",
	[15] = "升级或建造铜矿厂，增加产量",
	[16] = "选择需要建造或加速的建筑",
	[17] = "选择需要升级的装备",
	[18] = "选择需要购买的道具",
	[19] = "选择需要升级或加速的科技",
	[20] = "选择一个对手挑战",
	[21] = "选择需要探险的关卡",
	[22] = "选择需要探险的关卡",
	[23] = "选择需要探险的关卡",
	[24] = "点击作战中心，选择你要进入的试炼场",
	[25] = "点击军团商店，选择需要兑换的道具",
	[26] = "点击军团大厅，进行捐献",
	[27] = "点击作战中心，选择你要进入的试炼场,打败试炼场敌人可开启试炼箱",
	[28] = "在地图找到你的团员进行驻军",
	[29] = "选择需要强化的配件",
	[30] = "完成主线任务可获得海量经验和炮弹！"
}

CommonText.triggerGuide = {
	[1] = "战火即将点燃，占领矿点或攻击他人基地，可以获得大量资源。",
	[2] = "通过观察基地外观大小，繁荣度，可判断是否有掠夺价值。",
	[3] = "战胜地图中的矿点后可采集大量资源，注意，矿点有敌军防守！",
	[4] = "让我们厚积薄发，有一定实力后再来征服世界吧！",
	[5] = "设置阵型后才能进行竞技，试一下最大战力",
	[6] = "试着挑战一下其他指挥官吧！",
	[7] = "给不同坦克装备相应的配件，能显著提高坦克的战斗力。",
	[8] = "战胜关卡，就能获得不同品质的配件，试着挑战一下吧！",
	[9] = "军事学院可以招募不同将领，现在前往招募吧！",
	[10] = "尝试招募一位将领吧！",
	[11] = "能晶将进一步强化部队战斗力，攻打能晶关卡可获取！",
	[12] = "配件淬炼能大幅强化配件属性，淬炼到一定程度还能激活额外属性！",
	[13] = "亲爱的指挥官，随着您的不断成长，新的技术也在逐步研发。现在，秘密武器已解除限制，请跟随我一起看看吧！",
	[14] = "指挥官，军备系统已开启，请随我去看看吧！",
	[15] = "指挥官阁下，指挥部已授予您作战实验室的使用权限，快进去参观一下吧",
	[16] = "这里是研究院，您可以在这里管理材料的生产。",
	[17] = "下方的容器储存着已生产的材料，您只需要点击它们即可收取。",
	[18] = "现在让我们进行一次人员分配。",
	[19] = "点击加减按钮或拖动进度条进行人员分配，无人参与的项目不会进行生产。",
	[20] = "升级科技会提高可分配人数，改进建筑可解锁新的生产项目，请指挥官大人多多努力吧。"
	
}

CommonText.regulations = {
	{
		"攻击玩家可搬运敌方【资源】，摧毁敌军部队可获得【荣誉】",
		"使用【侦查】获取敌人防守部队情报，知己知彼百战不殆",
		"【防护罩】能预防敌人来袭，但同时也无法继续攻击敌人"
	},
	{
		"世界地图分布着不同等级的资源矿点，占领矿点后部队将自动进行【采集】",
		"高等级矿点【产量更高】，攻打获得【经验】越多，驻守敌人也【更加强大】",
		"选择与自身等级接近的矿点，使用【侦查】可获得驻守敌人部队情报"
	},
	{
		"【军团】是你的强力后盾，团友之间通过协防可以抵御敌人来袭",
		"最多可以拥有5支候选协防部队，选择其中一支作为防守部队"
	}
}

CommonText.PartPos2Name = {
	"芯片",
	"火控器",
	"合金",
	"弹头",
	"合金芯片",
	"火控弹头",
	"火控器芯片",
	"合金弹头",
	"防护核心",
	"穿刺核心",
}

CommonText.MuzhiAD = {}
CommonText.MuzhiAD[1] = {"空投支援","去观看","观看视频即可获得以上奖励"}
CommonText.MuzhiAD[2] = {"领取权限","观看1次视频，即可获得升级权限"}
CommonText.MuzhiAD[3] = {"免费领取","首充领取","每天观看%d次视频，连续%d天，即可免费领取首充奖励.","您今天已观看%d次视频，还需观看%d天"}
CommonText.MuzhiAD[4] = {"观看视频免费领取1点体力,每天可领取%d次","观看%d次视频可免费领取1本统率书\n每天可领取1次","领取次数已达上限","今天还可领取%d次"}
CommonText.MuzhiAD[5] = {"指挥官，您今天可领取%d %%经验加成哦！","指挥官，您今天可领取%d %%编制经验加成哦！","当前领取：","立即观看"}


CommonText.webRecharge = "充值特惠"


CommonText.CrossPlayerInfo = {
	[1] = "等级:",
	[2] = "战力:",
	[3] = "军团:",
	[4] = "服务器:"
}