/**
 * @Title: SysChatId.java
 * @Package com.game.constant
 * @Description:
 * @author ZhangJun
 * @date 2015年10月21日 上午11:46:29
 * @version V1.0
 */
package com.game.constant;

/**
 * @author ZhangJun
 * @ClassName: SysChatId
 * @Description: 系统广播编号
 * @date 2015年10月21日 上午11:46:29
 */
public interface SysChatId {
    final int RECRUIT_1 = 101;
    final int RECRUIT_2 = 102;
    final int RECRUIT_3 = 103;
    final int RECRUIT_4 = 104;

    // |%s|在竞技场大发神威，取得了|%s|连胜！我也要打
    final int ARENA_1 = 105;

    // 恭喜|%s|统率提升到|%s|级
    final int COMMAND_UP = 106;

    // |%s|在抽装备中获得了|%s| Lv.1
    final int GET_EQUIP = 107;

    // |%s|在竞技场中将|%s|拉下马，大家快去击败他
    final int ARENA_2 = 108;

    // 恭喜|%s|军衔提升到|%s|
    final int RANKS_UP = 109;

    // 恭喜|%s|声望提升到|%s|
    final int FAME_UP = 110;

    // 限时副本开启了，请大家前去获取宝藏吧！我要去
    final int LIMIT_COMBAT = 111;

    // 恭喜|%s|攻打资源点获得了|%s|
    final int ATTACK_MINE = 112;

    // [["恭喜",0],["",0],["组装了",0],["",0],["我也要组装!",1]]
    final int ASSEMBER_TANK = 113;

    // [["恭喜",0],["",0],["将",0],["",0],["升到了",0],["",0]]
    final int PURPLE_EQUIP = 114;

    // [["恭喜",0],["",0],["将",0],["",0],["强化到了",0],["",0]]
    final int PART_UPGRADE = 115;

    // [["恭喜",0],["",0],["在探宝中获得了",0],["",0],["我也要去探宝!",1]]
    final int EXPLORE_PROP = 116;

    // [["恭喜",0],["",0],["招募了将领",0],["",0],["我也要去招募将领!",1]]
    final int LOTTERY_HERO = 117;

    // [["恭喜",0],["",0],["进阶获得了将领",0],["",0],["我也要去进阶将领!",1]]
    final int IMPROVE_HERO = 118;

    // [["恭喜",0],["",0],["把将领",0],["",0],["升级到了",0],["",0],["我也要去升级将领!",1]]
    final int UPGRADE_HERO = 119;

    // [["恭喜",0],["",0],["很幸运获得了",0],["",0],["我也要去玩!",1]]
    final int LUCK_ROUND = 120;

    // [["恭喜",0],["",0],["打开了哈洛克的宝藏获得了",0],["",0],["我也要去玩!",1]]
    final int HALOKE_TREASURE = 121;

    // [["恭喜",0],["",0],["将",0],["",0],["改造到了",0],["",0]]
    final int PART_REFIT = 122;

    // [["恭喜",0],["",0],["在探宝中获得了",0],["",0],["我也要去探宝!",1]]
    final int EXPLORE_TANK = 123;

    // [["欢迎",0],["",0],["加入军团！",0]]
    final int JOIN_PARTY = 124;

    // [["",0],["军团发出招募告示：",0],["",0],["去看看",1]]
    final int RECRUIT_5 = 125;

    // [["",0],["退出了军团",0]]
    final int QUIT_PARTY = 126;

    // [["",0],["被任命为军团长",0]]
    final int PARTY_LEADER = 127;

    // [["",0],["被任命为副军团长",0]]
    final int PARTY_VICE_LEADER = 128;

    // [["",0],["被任命为",0],["",0]]
    final int PARTY_JOB = 129;

    // [["",0],["被",0],["",0],["踢出了军团",0]]
    final int PARTY_TICK = 130;

    // [["",0],["消灭了试炼场的",0],["",0],["前往领奖!",1]]
    final int PARTY_COMBAT = 131;

    // [["",0],["被",0],["",0],["淘汰,取得百团混战第",0],["",0],["名",0]]
    final int PARTY_WAR = 132;

    // [["恭喜",0],["",0],["获得了百团混战第一名,本次军团战结束",0]]
    final int PARTY_CHAMPION = 133;

    // [["",0],["的",0],["",0],["在百团混战中,光芒大盛,取得了5连胜!",0]]
    final int PARTY_WAR_WIN = 134;

    // [["V3重装坦克被",0],["",0],["击败,他获得了丰厚的奖励",0]]
    final int BOSS_KILL = 135;

    // [["V3重装坦克炮口被",0],["",0],["摧毁,他获得了丰厚的奖励",0]]
    final int BOSS_HURT = 136;

    // [["恭喜",0],["",0],["打开了银鹰将领宝箱获得了将领鲷哥!",0]]
    final int HERO_BOX = 139;

    //
    final int SYS_HORN = 146;

    // [["本军团改名为",0],["",0]]
    final int PARTY_NAME_CHANGE = 152;

    // [["",0],["使用了道具",0],["",0],["获得了珍贵物品",0],["",0]]
    final int OPEN_BOX = 153;

    // [["恭喜",0],["",0],["从每日充值中开启宝箱，获得",0],["",1],["我要参加!",1]]
    final int EVERY_DAY_CHARGE = 154;

    // [["恭喜",0],["",0],["很幸运获得了",0],["",1],["我也要玩!",1]]
    final int JOIN_ACTIVITY = 155;

    // [["恭喜,0",["",0],["成为VIP",0],["",0],["获得了大量特权!我要VIP",1]]
    final int BECOME_VIP = 147;

    // [["惊天爆料,某人挑战大神威严,胜利而归,点击查看最新战况",1]]
    final int Challenge_GOD_WIN = 156;

    // [["号外号外,某人挑战大神威严,铩羽而归,点击查看最新战况",1]]
    final int Challenge_GOD_FAIL = 157;

    // [["尊敬的",0],["",0],["：",0],["",0],["已经上线了。大家快来求签名啊！",0]]
    final int Buff_Job_On_Line = 158;

    // [["大明星",0],["",0],["：",0],["",0],["已经上线了。大家快来围观啊！",0]]
    final int DeBuff_Job_On_Line = 159;

    // [["要塞战已经打响，指挥官们可前往活动中心查看！",0],["前往",1]]
    final int Fortress_IS_Begin = 160;

    // [["本次要塞战已经结束,",0],["胜利军团",0],["：",0],["",0],["获得大量的奖励。",1]]
    final int Fortress_Is_End = 170;

    // [["要塞之王",0],["：",0],["",0],["将",0]["",0],["任命为",0],["",0]]
    final int Fortress_Job_Appoint = 171;

    // [["要塞战预热已经开始，指挥官们可前往活动中心查看！",0],["前往",1]]
    final int Fortress_Pre = 172;

    // 成功击败了防守要塞的\",0],[\"距离胜利又迈出了一步\",0]]', '[s,s]
    final int Fortress_Defence_Fail = 173;

    // 召唤祭坛BOSS [["军团BOSS已经开启，尊敬的指挥官请火速前往战场",0],["我也要打",1]]
    final int Altar_Boss_Call = 174;

    // 击杀祭坛BOSS [["军团BOSS已被击杀，可领取奖励！",0],["我要领取",1]]
    final int Altar_Boss_Kill = 175;

    // 祭坛BOSS逃跑 [["军团BOSS已逃跑，请下次努力！",0]]
    final int Altar_Boss_End = 176;

    // 能晶合成 [["恭喜",0],["",0],["将",0],["",1],["升到了",0],["LV.",0],["",0]]
    final int Energy_Stone_Combine = 177;

    /**
     * 军事演习（红蓝大战）活动开始， [["军事演习报名已经开始，请指挥官们前往参谋部报名！",0],["前往",1]]
     */
    final int Drill_Start = 178;

    /**
     * 军事演习（红蓝大战）活动开始备战， [["军事演习备战已经开始，请指挥官们前往参谋部设置部队！",0],["前往",1]]
     */
    final int Drill_Prepare = 179;

    /**
     * 军事演习（红蓝大战）活动结束， [["本次军事演习已经结束,",0],["胜利 阵营" ,0],["：",0],["",0],["获得大量的奖励。",1]]
     */
    final int Drill_End = 180;

    /**
     * 军事演习（红蓝大战）活动报名即将结束， [["军事演习报名将在20:30结束，请未报名的指挥官们抓紧时间报名！",0],["前往",1]]
     */
    final int Drill_Enroll_Near_End = 181;

    /**
     * 军事演习（红蓝大战）活备战即将结束， [["军事演习备战将在20:55结束，请未报名的指挥官们抓紧时间排兵布阵！",0],["前往",1]]
     */
    final int Drill_Prepare_Near_End = 182;

    /**
     * 军事演习（红蓝大战）活动3连胜， [["",0],["的",0],["",0],["在",0],["",0],["中,光芒大盛,取得了3连胜!",0]]
     */
    final int Drill_Win3 = 183;

    /**
     * 军事演习（红蓝大战）活动7连胜， [["",0],["的",0],["",0],["在",0],["",0],["中,势不可挡,取得了7连胜!",0]]
     */
    final int Drill_Win7 = 184;

    /**
     * 军事演习（红蓝大战）活动10连胜，[["",0],["的",0],["",0],["在",0],["",0],["中,无人能敌,取得了10连胜!" ,0]]
     */
    final int Drill_Win10 = 185;

    /**
     * 军事演习（红蓝大战）活动无效， [["由于参与军事演习人员不足，本次军事演习无法进行，请期待下次大战！",0]]
     */
    final int Drill_Invalid = 186;

    /**
     * 叛军入侵活动开始， [["叛军正在世界猖獗肆虐，请指挥官速去击杀！",0]，["前往",1]]
     */
    final int Rebel_Start = 187;

    /**
     * 叛军入侵活动，所有叛军死亡， [["在指挥官们共同的努力下，叛军全部被击杀，发放全服奖励！"，0]]
     */
    final int Rebel_All_Dead = 188;

    /**
     * 叛军入侵活动结束， [["遗憾的是有几支叛军见势不妙，偷偷溜走，请指挥官下次继续努力！"，0]]
     */
    final int Rebel_End = 189;

    /**
     * 叛军小队刷新， [["叛军小队已抵达，请指挥官速去击杀！",0]，["前往",1]]
     */
    final int Rebel_Unit = 190;

    /**
     * 叛军中队刷新， [["叛军中队已抵达，请指挥官速去击杀！",0]，["前往",1]]
     */
    final int Rebel_Guard = 191;

    /**
     * 叛军头目刷新， [["叛军头目已抵达，请指挥官速去击杀！",0]，["前往",1]]
     */
    final int Rebel_Leader = 192;

    // [["世界争霸已经开启，指挥官们快去争夺参赛资格吧!",0],["前往",1]]
    final int Cross_Begin = 193;

    // [["世界争霸报名已经开启，请指挥官们抓紧时间报名!",0],["前往",1]]
    final int Cross_Reg = 194;

    // 今天的积分赛已经开启，各位参赛选手可以去对应界面关注比赛。查看战况
    final int Cross_JiFen_Brocast = 195;

    // 今天的淘汰赛已经开启，指挥官们可以进入界面支持选手，关注比赛
    final int Cross_TaoTai_Brocast = 196;

    // 决赛日争霸已经开启，指挥官们可以进入界面支持选手，关注比赛
    final int Cross_Jue_Sai_Brocast = 197;

    // 恭喜XXX获得世界争霸巅峰组冠军，XXX获得精英组冠军，让我们恭喜他们！
    final int Cross_Champion_Brocast = 198;

    // 世界争霸已经结束，请指挥官们前往相关界面兑换领取奖励
    final int Cross_Award_Brocast = 199;

    // 跨服战结束
    final int Cross_End = 200;

    // [["恭喜",0],["",0],["将",0],["",1],["打磨到了",0],["LV.",0],["",0]]
    final int MEDAL_REFIT = 201;

    // [["恭喜",0],["",0],["将",0],["",1],["温养到了",0],["LV.",0],["",0]]
    final int MEDAL_UP = 202;

    // 装备进阶
    int Equip_Quality_Up = 211;

    // [["",0],["带着福袋逃跑了，下次可得当心呐！",0]]
    int ACT_BOSS_RUN = 212;
    // [["你们成功抢光了",0],["",0],["所有的福袋，干得漂亮！",0]]
    int ACT_BOSS_KILL = 213;
    // [["",0],["手速惊人，竟然抢走了,0],["",0],["的最后一个福袋!",0]]
    int ACT_BOSS_KILL_LAST = 214;
    // [["",0],["成功召唤了一只贺岁机甲",0],["",0],["可前往抢夺福袋",0],["前往",1]]
    int ACT_BOSS_CALL = 215;

    int CP_BEGIN = 220;// 220 [["本次军团争霸已经开始。请各位指挥官在本日的百团混战中获取参赛资格。",0],["前往",1]] []
    int CP_REG = 221; // 221 [["本次军团争霸已经开始报名。请获取到参赛资格的指挥官前往活动界面报名。",0],["前往",1]] []
    int CP_PRE = 222;// 222 [["本次军团争霸小组赛正在备战中，出线指挥官可前往活动界面设置阵型",0],["前往",1]] []
    int cp_223 = 223;// 223 [["万众瞩目的军团争霸决赛已开启，新一代王者军团将在此诞生！获得最终排名的三支军团将会为所在服务器提供超级大奖。",0],["前往",1]] []
    int cp_224 = 224;// 224 [["恭喜",0],["",0],["的",0],["",0],["获得本届军团争霸冠军",0]] [s,s]
    int cp_225 = 225;// 225 [["",0],["的",0],["",0],["在",0],["",0],["中,光芒大盛,取得了5连胜!",0]] [s,s,s]
    int cp_226 = 226;// 226 [["",0],["的",0],["",0],["在",0],["",0],["中,势不可挡,取得了7连胜!",0]] [s,s,s]
    int cp_227 = 227;// 227 [["",0],["的",0],["",0],["在",0],["",0],["中,无人能敌,取得了9连胜!",0]] [s,s,s]
    int cp_228 = 228;// 228 [["",0],["的",0],["",0],["在",0],["",0],["中,有如神助,取得了11连胜!",0]] [s,s,s]
    int cp_229 = 229;// 229 [["尊敬的指挥官本届军团争霸全部战事已经全部结束",0],["请各位指挥官领取奖励和查看积分商城选取兑换物品",0],["前往",1]] []
    int cp_230 = 230;// 230 [["恭喜",0],["",0],["的",0],["",0],["在小组赛中取得第",0],["",0],[["名，成功出线",0]] [s,s,s]
    int cp_231 = 231;// 231 [["本次军团争霸决赛赛正在备战中，出线指挥官可前往活动界面设置阵型",0],["前往",1]] []
    int cp_232 = 232;// 232 [["本次军团争霸小组赛正在进行中，各位指挥官可前往活动界面查看详情",0],["前往",1]] []
    int cp_233 = 233;// 233 [["",0],["的",0],["",0],["竟然把",0],["",0],["的",0],["",0],["终结了，真令人惊叹！",0]] [s,s,s,s]
    int cp_234 = 234; // 跨服军团结束

    // 配件进阶
    int PART_QUALITY_UP = 254;// [["恭喜",0],["",0],["将",0],["",1],["进阶到",0],["",1]]

    int AWAKEN_HERO_SKILL_MAIN_LV_FULL = 255;// [["恭喜",0],["",0]["成功觉醒了",0],["",1]]
    int AWAKEN_HERO_SKILL_LV_FULL = 256;// [["",0],["小手一抖",0],["",1],["技能就有",0]]

    int AIRSHIP_ATTACK = 257;// 指挥官[["",0]]振臂一呼,发起了针对[["",0]]的[["",0]]的攻击,请火速支援.[前往,1]
    int AIRSHIP_DEFENCE = 258;// 我方飞艇|%s|受到了|%s|的|%s|的攻击,请火速支援.[前往,1]\
    int AIRSHIP_NOT_ENOUGH_COMMANDER = 259;// 我军成功占领了[["",0]],由于没有足够的指挥官管理飞艇,飞艇已经被放弃.
    int AIRSHIP_ATTACK_LATE = 260;// 针对飞艇[["",0]]的进攻受阻,该已经被其他玩家成功夺取,我方部队正在返回.;

    int MEDAL_TRAINS = 274;// [["恭喜",0],["",1],["将",0],["",1],["精炼为",0],["",1]]

    int SecretWeapon = 275;// [["恭喜",0],["",1],["激活了秘密武器--",0],["",1]]

    int VIP_COUNT_NOT_FINISH = 279;// [["全服期待，苦盼大咖。V"],["",0],["奖励就差最后",0],["",0],["人即可达成。",0],["我要当大咖",1]]

    int VIP_COUNT_FINISH = 280;// [["大咖带队，全服同庆。本服V"],["",0],["档位奖励已达成，请各位指挥官快快",0],["去领奖",1],["吧！"],0]]

    int ACT_RED_BAG_MONEY = 281;// [["红包天降活动",0],["",0],["档位奖励已达成，请各位指挥官快快",0],["去领奖",1],["吧！",0]]
    int ACT_LUCKY = 282;// [["恭喜玩家",0],["",0],["在幸运奖池活动中，运气爆棚，抽中了",0],["",0],["奖池的奖励，获得",0],["",0],["金币",0],["我也要抽",1]]

    int BOUNTY_TEAM_INVITE = 283; // 指挥官[["",0]]振臂一呼,发起了针对[["",0]]的攻击,请火速支援.[加入队伍,1]

    int REBEL_HEAD_BOX = 284; // [["喜从天降，叛军头目",0],["",0],["被玩家",0],["",0],["击杀后，掉落了一个礼盒！",0],["前往拾取",1]]

    int EQUIP_UPSTAR = 285; // [["恭喜",0],["",0],["升星获得",0],["",1],["，实力获得了大幅提升！",0]]

    int ACTIVE_BOX = 286; // [["指挥官",0],["",0],["打开了活跃宝箱,竟幸运的获得了珍稀道具",0],["",0],["",0],["个!",0]]

    int HONOURl_LIVE_OPEN = 287; // [["本次荣耀生存已开启，各位指挥官可以准备争夺最后的荣耀啦！",0]]

    int HONOURl_LIVE_PHASE = 288; // [["荣耀区第"],["",0],["圈已确定，一起为最终的荣耀努力吧！",0]]

    int HONOURl_LIVE_FINAL = 289; // [["最后荣耀区已确定，快去荣耀区采集并获得金币吧！",0]]

    int HONOURl_LIVE_CLOSE = 290; // [["本次荣耀生存已结束，指挥官们不要忘记领取排行奖励哦！",0]]["前往领取",1]]

    int world_level_1 = 291; // [["在指挥官们共同的努力下,世界矿点成功升至",0]["",0]["级!",0]]

    int world_level_2 = 292; // [["由于各位指挥官未能完成目标,世界矿点降至",0]["",0]["级,希望各位指挥官再接再厉!",0]]

    int REBEL_BOSS = 293; // [["叛军boss已降临，超多福利，请指挥官速去击杀！",0],["前往",1]]

    int ACT_SEND_RED_BAG = 1001;// [["",0],["土豪发送了",0],["",0],["红包，赶紧去抢啊！",0]]

    int REBEL_RED_BAG = 1002;// [["玩家",0],["",0],["领取叛军礼盒时意外触发了一个红包，赶紧去抢啊！",0]]
    int REBEL_RED_BOOS_BAG = 1003;// [["玩家",0],["",0],["领取叛军礼盒时意外触发了一个红包，赶紧去抢啊！",0]]

}
