/**
 * @Title: SysChatId.java @Package com.game.constant @Description: TODO
 *
 * @author ZhangJun
 * @date 2015年10月21日 上午11:46:29
 * @version V1.0
 */
package com.game.constant;

/**
 * @ClassName: SysChatId @Description: TODO
 *
 * @author ZhangJun
 * @date 2015年10月21日 上午11:46:29
 */
public interface SysChatId {
  final int RECRUIT_1 = 101;
  final int RECRUIT_2 = 102;
  final int RECRUIT_3 = 103;
  final int RECRUIT_4 = 104;

  // |%s|在竞技场大发神威，取得了|%s|连胜！我也要打
  final int ARENA_1 = 105;

  // 恭喜|%s|统率提升到|%s|级
  final int COMMAND_UP = 106;

  // |%s|在抽装备中获得了|%s| Lv.1
  final int GET_EQUIP = 107;

  // |%s|在竞技场中将|%s|拉下马，大家快去击败他
  final int ARENA_2 = 108;

  // 恭喜|%s|军衔提升到|%s|
  final int RANKS_UP = 109;

  // 恭喜|%s|声望提升到|%s|
  final int FAME_UP = 110;

  // 限时副本开启了，请大家前去获取宝藏吧！我要去
  final int LIMIT_COMBAT = 111;

  // 恭喜|%s|攻打资源点获得了|%s|
  final int ATTACK_MINE = 112;

  // [["恭喜",0],["",0],["组装了",0],["",0],["我也要组装!",1]]
  final int ASSEMBER_TANK = 113;

  // [["恭喜",0],["",0],["将",0],["",0],["升到了",0],["",0]]
  final int PURPLE_EQUIP = 114;

  // [["恭喜",0],["",0],["将",0],["",0],["强化到了",0],["",0]]
  final int PART_UPGRADE = 115;

  // [["恭喜",0],["",0],["在探宝中获得了",0],["",0],["我也要去探宝!",1]]
  final int EXPLORE_PROP = 116;

  // [["恭喜",0],["",0],["招募了将领",0],["",0],["我也要去招募将领!",1]]
  final int LOTTERY_HERO = 117;

  // [["恭喜",0],["",0],["进阶获得了将领",0],["",0],["我也要去进阶将领!",1]]
  final int IMPROVE_HERO = 118;

  // [["恭喜",0],["",0],["把将领",0],["",0],["升级到了",0],["",0],["我也要去升级将领!",1]]
  final int UPGRADE_HERO = 119;

  // [["恭喜",0],["",0],["很幸运获得了",0],["",0],["我也要去玩!",1]]
  final int LUCK_ROUND = 120;

  // [["恭喜",0],["",0],["打开了哈洛克的宝藏获得了",0],["",0],["我也要去玩!",1]]
  final int HALOKE_TREASURE = 121;

  // [["恭喜",0],["",0],["将",0],["",0],["改造到了",0],["",0]]
  final int PART_REFIT = 122;

  // [["恭喜",0],["",0],["在探宝中获得了",0],["",0],["我也要去探宝!",1]]
  final int EXPLORE_TANK = 123;

  // [["欢迎",0],["",0],["加入军团！",0]]
  final int JOIN_PARTY = 124;

  // [["",0],["军团发出招募告示：",0],["",0],["去看看",1]]
  final int RECRUIT_5 = 125;

  // [["",0],["退出了军团",0]]
  final int QUIT_PARTY = 126;

  // [["",0],["被任命为军团长",0]]
  final int PARTY_LEADER = 127;

  // [["",0],["被任命为副军团长",0]]
  final int PARTY_VICE_LEADER = 128;

  // [["",0],["被任命为",0],["",0]]
  final int PARTY_JOB = 129;

  // [["",0],["被",0],["",0],["踢出了军团",0]]
  final int PARTY_TICK = 130;

  // [["",0],["消灭了试炼场的",0],["",0],["前往领奖!",1]]
  final int PARTY_COMBAT = 131;

  // [["",0],["被",0],["",0],["淘汰,取得百团混战第",0],["",0],["名",0]]
  final int PARTY_WAR = 132;

  // [["恭喜",0],["",0],["获得了百团混战第一名,本次军团战结束",0]]
  final int PARTY_CHAMPION = 133;

  // [["",0],["的",0],["",0],["在百团混战中,光芒大盛,取得了5连胜!",0]]
  final int PARTY_WAR_WIN = 134;

  // [["V3重装坦克被",0],["",0],["击败,他获得了丰厚的奖励",0]]
  final int BOSS_KILL = 135;

  // [["V3重装坦克炮口被",0],["",0],["摧毁,他获得了丰厚的奖励",0]]
  final int BOSS_HURT = 136;

  // [["恭喜",0],["",0],["打开了银鹰将领宝箱获得了将领鲷哥!",0]]
  final int HERO_BOX = 139;

  //
  final int SYS_HORN = 146;

  // [["本军团改名为",0],["",0]]
  final int PARTY_NAME_CHANGE = 152;

  // [["",0],["使用了道具",0],["",0],["获得了珍贵物品",0],["",0]]
  final int OPEN_BOX = 153;

  // [["恭喜",0],["",0],["从每日充值中开启宝箱，获得",0],["",1],["我要参加!",1]]
  final int EVERY_DAY_CHARGE = 154;

  // [["恭喜",0],["",0],["很幸运获得了",0],["",1],["我也要玩!",1]]
  final int JOIN_ACTIVITY = 155;

  // [["恭喜,0",["",0],["成为VIP",0],["",0],["获得了大量特权!我要VIP",1]]
  final int BECOME_VIP = 147;

  // [["惊天爆料,某人挑战大神威严,胜利而归,点击查看最新战况",1]]
  final int Challenge_GOD_WIN = 156;

  // [["号外号外,某人挑战大神威严,铩羽而归,点击查看最新战况",1]]
  final int Challenge_GOD_FAIL = 157;

  // [["尊敬的",0],["",0],["：",0],["",0],["已经上线了。大家快来求签名啊！",0]]
  final int Buff_Job_On_Line = 158;

  // [["大明星",0],["",0],["：",0],["",0],["已经上线了。大家快来围观啊！",0]]
  final int DeBuff_Job_On_Line = 159;

  // [["要塞战已经打响，指挥官们可前往活动中心查看！",0],["前往",1]]
  final int Fortress_IS_Begin = 160;

  // [["本次要塞战已经结束,",0],["胜利军团",0],["：",0],["",0],["获得大量的奖励。",1]]
  final int Fortress_Is_End = 170;

  // [["要塞之王",0],["：",0],["",0],["将",0]["",0],["任命为",0],["",0]]
  final int Fortress_Job_Appoint = 171;

  // [["要塞战预热已经开始，指挥官们可前往活动中心查看！",0],["前往",1]]
  final int Fortress_Pre = 172;

  // 成功击败了防守要塞的\",0],[\"距离胜利又迈出了一步\",0]]', '[s,s]
  final int Fortress_Defence_Fail = 173;

  // 召唤祭坛BOSS		[["军团BOSS已经开启，尊敬的指挥官请火速前往战场",0],["我也要打",1]]
  final int Altar_Boss_Call = 174;

  // 击杀祭坛BOSS		[["军团BOSS已被击杀，可领取奖励！",0],["我要领取",1]]
  final int Altar_Boss_Kill = 175;

  // 祭坛BOSS逃跑		[["军团BOSS已逃跑，请下次努力！",0]]
  final int Altar_Boss_End = 176;

  // [["世界争霸已经开启，指挥官们快去争夺参赛资格吧!",0],["前往",1]]
  final int Cross_Begin = 193;

  // [["世界争霸报名已经开启，请指挥官们抓紧时间报名!",0],["前往",1]]
  final int Cross_Reg = 194;

  // 今天的积分赛已经开启，各位参赛选手可以去对应界面关注比赛。查看战况
  final int Cross_JiFen_Brocast = 195;

  // 今天的淘汰赛已经开启，指挥官们可以进入界面支持选手，关注比赛
  final int Cross_TaoTai_Brocast = 196;

  // 决赛日争霸已经开启，指挥官们可以进入界面支持选手，关注比赛
  final int Cross_Jue_Sai_Brocast = 197;

  // 恭喜XXX获得世界争霸巅峰组冠军，XXX获得精英组冠军，让我们恭喜他们！
  final int Cross_Champion_Brocast = 198;

  // 世界争霸已经结束，请指挥官们前往相关界面兑换领取奖励
  final int Cross_Award_Brocast = 199;

  // 跨服战结束
  final int Cross_End = 200;

  final int CP_BEGIN = 220; // 220	[["本次军团争霸已经开始。请各位指挥官在本日的百团混战中获取参赛资格。",0],["前往",1]]	[]
  final int CP_REG = 221; // 221	[["本次军团争霸已经开始报名。请获取到参赛资格的指挥官前往活动界面报名。",0],["前往",1]]	[]
  final int CP_PRE = 222; // 222	[["本次军团争霸小组赛正在备战中，出线指挥官可前往活动界面设置阵型",0],["前往",1]]	[]
  final int cp_223 =
      223; // 223	[["万众瞩目的军团争霸决赛已开启，新一代王者军团将在此诞生！获得最终排名的三支军团将会为所在服务器提供超级大奖。",0],["前往",1]]	[]
  final int cp_224 = 224; // 	224	[["恭喜",0],["",0],["的",0],["",0],["获得本届军团争霸冠军",0]]	[s,s]
  final int cp_225 =
      225; //	225	[["",0],["的",0],["",0],["在",0],["",0],["中,光芒大盛,取得了5连胜!",0]]	[s,s,s]
  final int cp_226 =
      226; //	226	[["",0],["的",0],["",0],["在",0],["",0],["中,势不可挡,取得了7连胜!",0]]	[s,s,s]
  final int cp_227 =
      227; //	227	[["",0],["的",0],["",0],["在",0],["",0],["中,无人能敌,取得了9连胜!",0]]	[s,s,s]
  final int cp_228 =
      228; //	228	[["",0],["的",0],["",0],["在",0],["",0],["中,有如神助,取得了11连胜!",0]]	[s,s,s]
  final int cp_229 =
      229; //	229	[["尊敬的指挥官本届军团争霸全部战事已经全部结束",0],["请各位指挥官领取奖励和查看积分商城选取兑换物品",0],["前往",1]]	[]
  final int cp_230 =
      230; //	230	[["恭喜",0],["",0],["的",0],["",0],["在小组赛中取得第",0],["",0],[["名，成功出线",0]]	[s,s,s]
  final int cp_231 = 231; // 	231	[["本次军团争霸决赛赛正在备战中，出线指挥官可前往活动界面设置阵型",0],["前往",1]]	[]
  final int cp_232 = 232; // 	232	[["本次军团争霸小组赛正在进行中，各位指挥官可前往活动界面查看详情",0],["前往",1]]	[]
  final int cp_233 =
      233; //	233	[["",0],["的",0],["",0],["竟然把",0],["",0],["的",0],["",0],["终结了，真令人惊叹！",0]]	[s,s,s,s]
  final int cp_234 = 234; // 跨服军团结束
}
